[{"name":"Aman Photography","rating":"0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116515_WhatsApp_Image_2022_05_21_at_12.31.02_PM__9_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__1_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__2_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__3_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__4_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__5_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__6_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116516_WhatsApp_Image_2022_05_21_at_12.31.02_PM__7_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116515_WhatsApp_Image_2022_05_21_at_12.31.02_PM__8_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116515_WhatsApp_Image_2022_05_21_at_12.31.03_PM.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3119255\/1653116515_WhatsApp_Image_2022_05_21_at_12.31.03_PM__1_.jpeg"],"prices":"50,000","address":["Vijay Nagar, Indore",""],"description":"Aman Photography is a professional wedding photography services in Indore. Aman Photography has been a part of the wedding industry since 2017 and the pictures clicked by the team are full of emotions. Also offering Videography and pre-wedding shoots, Aman Photography is a one-stop solution for covering your entire wedding celebrations.Services Offered by Aman Photography-There are various services offered by this wedding photography service for a number of wedding festivities such as simple home engagements before the wedding to large scale wedding ceremonies. The services offered are: * Candid Photography* Traditional Photography * Traditional Videography * Cinematic Video * Pre Wedding Shoots * Pre Wedding Films * Wedding Albums* Maternity Shoots* Model photographyThe well-equipped photographers from Aman Photography would be happy to travel to your preferred wedding destinations and provide their wide range of services for your wedding ceremony","review":[]},{"name":"Ananta Spa & Resort Jaipur","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1707394309_Screenshot_2024_02_08_173901.png?crop=44,72,875,492","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569637_4.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569642_29.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569644_10.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569637_14.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569639_21.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569642_11.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1707394307_Screenshot_2024_02_08_173835.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569638_3.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569641_17.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569638_1.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2741919\/1717569640_25.JPG"],"prices":"3,500","address":["Amer, Jaipur","Ananta Spa & Resort Jaipur, Delhi - Jaipur Expressway, Amer, Bhanpur Kalan,..."],"description":"Ananta Spa & Resort Jaipur is a luxurious wedding venue located in Jaipur Expressway, Amer, Bhanpur Kalan, Jaipur. With both indoor and outdoor spaces available, the resort can accommodate up to 250 guests, making it a popular choice for weddings, engagements, cocktails, and other celebrations. The venue offers 160 rooms, providing accommodation for guests and the wedding party, making it a convenient one-stop solution for a wedding hotel.*Space Available and Capacity at Ananta Spa & Resort Jaipur *The venue offers both indoor and outdoor spaces, accommodating up to 250 guests. It is ideal for weddings and events with gathering sizes of under 250 guests, offering flexibility for smaller or larger gatherings.*Cuisines at Ananta Spa & Resort Jaipur *The venue caters to weddings with its own in-house kitchen, offering a variety of delicacies for wedding guests. The venue provides both vegetarian and non-vegetarian cuisine options on its premises.*Facilities Provided by Ananta Spa & Resort Jaipur *The resort offers -In-house decorCatering servicesIn-house alcohol availableOutside alcohol permittedParking facilitiesSmall-sized gatherings allowed for pre-wedding functions*Location of Ananta Spa & Resort Jaipur *Located in Jaipur Expressway, Amer, Bhanpur Kalan, Jaipur, the venue is easily accessible and offers a picturesque setting for weddings and events.","review":[["Kanwar","5.0","It was an amazing experience for me to attend a wedding at Ananta Resort and Spa Jaipur lately  Every thing was flawless thanks to Mr. Gaurav's exceptional hospitality.Highly recommended."],["Avinash","5.0","The best thing is the water garden which is unique Guest relationship managers Palmo and Liza are very great people they help you a lot good location great rooms in short.. highly recommended."]]},{"name":"Beyond Photos","rating":"4.1","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630656528_Untitled_1.jpg?crop=14,2,2015,1133","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655938_DSC08122.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655930_DSC02877.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655926_S53A1753.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655933_SSP_0392.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655932_DSC08556.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655932__DSC9843.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655934_DSC00804.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655932_SSP_0903.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655928_S53A1068.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655934_DSC01070.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2102146\/1630655932__DSC0125.jpg"],"prices":"100,000","address":["Sarita Vihar, Delhi NCR",""],"description":"About Beyond Photos, Wedding photographers, Sarita Vihar, Delhi NCRBeyond Photos is one of the most popular wedding photography companies started by Shubham 8 years back in Delhi. The pictures clicked by this brand are beyond imagination. They are real, well-timed, and simply amazing. If you are planning to tie the knot at any time shortly, Shubham can click some of the most amazing and natural pictures of your wedding. Services offered by Beyond PhotosUnlike other photographers Beyond Photos catches guests unattended and clicks the most real and natural pictures. Shubham clicks all kinds of pictures from pre-wedding, wedding, reception, cocktails, and many more. Here are some of the services the brand offers:Candid PhotographyWedding filmsMehndi & SangeetCocktail partyReception Traditional PhotographyPre-wedding shootsPre-wedding filmsAlbumFashion shootsMaternity shootsBaby shootsWorking style of Beyond PhotosThe memories captured by Beyond Photos are timeless in the sense that they will be loved for generations. There is emotion in every picture and reminds one of the wonderful times they have spent during the wedding. Shubham and his team are extremely dedicated to their work and this is one of the main reasons why one should hire them. LocationBeyond Photos is based in Sarita Vihar, Delhi NCR. If you are planning to get married, Beyond Photos is the best option for an exceptional experience. ","review":[["navneet bawa","5.0","I could not have asked for a better photographer. He shot our roka and all big\/small wedding related events. He understood exactly what I wanted aesthetically and was open to accomodating ideas that I gave them. They did not use any copy paste formula and took time to understand our personalities while shooting us. The wedding trailer and movie was beautifully put together in the first edit itself because they knew what we were looking for and the emotions that we wanted to capture during the process.Source"],["Varuna ","0.5","Shubham and his team lost our entire data after the wedding and have been completely unapologetic about it. They have made no efforts to recover the data and have only provided a few photographs claiming its the whole data. \n\nWould recommend all future couples to be cautious of this. "],["Sanya Kejriwal","5.0","Absolutely wonderful, the photographs and the experience with the team !! Shubham has been more than warm and courteous all while. The photos captured the event and the emotions all together. More importantly, post the events, his team and himself, he has corresponded and delivered on time, without any delays or excuses. For a warm, wonderful experience and amazing photography and videography, his company will always be in my top recommendations. "],["radhika goel","5.0","Had a wonderful experience with Shubham! He is extremely committed to his work and the results are great. Loved the way he captured all the emotions at my event."],["Vansha Sethi Suneja","5.0","Amazing work!! His presence is so effortless that while the photos are being taken it doesn’t make you conscious at all, and the photos, in specific, the candid shots came out so beautiful and natural, it was exactly what I wanted. "]]},{"name":"D.Menon Weddings","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1669266340_Screenshot_3964.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250935_DSC02571_01.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250939_DSC02561_02.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250942_DSC02558_01.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250948_IMG_5144_02.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250954_DSC02523_01.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250962_DSC02461_01.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250968_DSC02496_01.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1675250972_DSC02442_02.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1669266340_Screenshot_3964.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1669094411_IMG_20220916_155038.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3718600\/1669094413_IMG_20220916_153520.jpg"],"prices":"200,000","address":["Eroor, Ernakulam",""],"description":"D.Menon Weddings is a company based in the city of Ernakulam that offers excellent event planning services to their clients. The wedding is one of the most important celebrations, and there is no denying the grandeur of the occasion and the magnificent arrangements that the ceremony necessitates as one of the most important celebrations in your life and in the family. You can get professional help from D.Menon Weddings to make this grand festival a smashing success.Services provided by D.Menon WeddingsD.Menon Weddings is a group of professionals who have been in the industry for a long time and have accumulated the necessary experience to boast an expert hand in the profession and to assist you in planning your big day and ensuring that your wedding is transformed into a grand gala of flawless transitions that are also hassle-free and smooth. They are also willing to travel to your wedding location to provide their services.They are a team that will work closely with you, taking your requirements as their instructions and assisting you in creating the perfect fairytale for yourself with services such as:Vendor administrationManagement of Event FlowDecoration preparation and executionManagement of GuestsDesign of entertainmentTravels to venueYes, the vendor travels to venue to provide the services","review":[["Devika ","5.0","We owe the ultimate success of our wedding events to Deepa S Menon and her company, @d. menonweddings. From start to finish, Deepa ensured that every setup, flow, and aspect of management was handled with exceptional professionalism and care. Thanks to her meticulous planning and execution, we experienced no hassles during the event and were able to fully enjoy our special day. We highly recommend Deepa S Menon for her outstanding wedding planning services and her ability to make every moment memorable.Source"]]},{"name":"Dipak Studios","rating":"4.8","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1706585807_05__6__copy.jpg?crop=0,212,2048,1152","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696082525_image9770.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1698317256_image7570.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1670446613_avmx19a.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696064412_image6919.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696065173_image1115.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1698317262_image7556.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696064128_image7360.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1698317266_image3450.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696065912_image6740.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696245539_image2599.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/226\/1696066149_image1943.jpg"],"prices":"150,000","address":["South Delhi, Delhi NCR",""],"description":"Dipak Studios, powered by imaging experts Mohan & Raman Dipak, is a renowned wedding photography company based in Lajpat Nagar 2, South Delhi. Loved by celebrities like Rishi Kapoor and Amitabh Bachchan, Dipak Studios aims to deliver moments with a unique flavor, making them feel timeless. Established in 1962 by Mr. Sunder Dipak as a small photo studio in Faridabad, it is now led by his sons Raman and Mohan, who have successfully covered hundreds of celebrity weddings all over India.Services Offered by Dipak StudiosThe team specializes in photojournalistic, modern, and imaginative styles of photography. They specialize in both candid and traditional styles of photography and videography, ensuring that every moment of your pre-wedding, wedding, and post-wedding functions is beautifully captured. They provide high-quality photographs and videos within one to two months after the functions, offering a variety of packages that can be customized according to your budget. The services offered by the team include:Candid PhotographyTraditional PhotographyPre-wedding ShootsCinematographyTraditional VideographyAlbumsPhotoboothWorking Style of Dipak StudiosThe team is dedicated to delivering candid and narrative moments that weave a story around your special day. They strive to capture every detail with perfection and finesse, ensuring that each photograph tells a story and evokes emotions.Travels to Venue:The team operates from three locations with a head office in Delhi and wedding studios in Faridabad and Gurgaon. They are open to traveling to various locations to cover wedding functions, providing photography services at reasonable prices for destination weddings.","review":[["geetaa paul ","5.0","From the time that I started planning my daughter‘s wedding which is 4 years ago the only thing I was very sure about was the photographer and that was going to be dipak  Studios, I have always seen his work and admired it but my real time experience has been even more  amazing with Raman  and and his team. They were so involved and took the perfect shots and videos that they have created lifetime memories for us, I can’t thank him enough for taking such personal attention and creating magic with his cameras, I feel Photographer is something you should never compromise on when planning a wedding because they live with you through pictures all your life.. I’m so glad that I didn’t and I made the right choice of working with Dipak Studios. They are extremely professional and fantastic at their work. Each picture video and reel is a masterpiece. I would recommend Dipak Studios handsdown every single time. Thank you Raman."],["Rishab Narayanan","5.0","Honestly, a lot of fun to work with. They capture great moments and bring back the nostalgia when i look at them again. Amazing bunch of guys & very flexible!\nKudos to Gautam & the entire Dipak Studios Team. 100% Recommend speaking and working with them for your events."],["Mahek","0.5","Very bad experience! It’s been 1.5 years and still haven’t received wedding album of my sister. Now they are not even replying to our messages and calls. \nNot a professional behaviour."],["Vinamra Agrawal","5.0","Aman from Dipak Studios did an exceptional job capturing our wedding and all the related events! We were impressed by the effort put by the entire team. On the event days, Aman and his team were incredible—literally present everywhere, ensuring no moment was missed. The quality of the photos and videos surpassed all our expectations, and the same-day edit was a massive hit with our guests! If you’re searching for someone to document your special day flawlessly, we wholeheartedly recommend Aman and Dipak Studios. A perfect 5-star experience! 😄😄"],["VINEET JAIN","5.0","Dipak studios was a last minute change based on the suggestion from a friend and buoy they just added life to our daughters wedding .. all the pics, reels and videos are just amazing that we can’t take our eyes off them and keep looking again and again.. Wedding was in Fairmont Jaipur in Aug 2024. Dipak studios team made sure every moment is captured, every family member is covered and no aspect is left behind in the wedding .. clearly our best choice of the wedding partner .. along with Fairmont hotel .. Pics speaks for itself and everyone who sees them are in awe of the wedding and the quality of work. Thank you Dipak studio once again 😍"],["Shrenik Jain","5.0","Amanji from Dipak Studios captured our wedding and all the events, and he did an absolutely phenomenal job! From the very first meeting, Amanji was attentive, professional, and truly understood our vision. On the day of the events, he and his team were everywhere, capturing every little moment while blending seamlessly into the background. The quality of the photos and videos exceeded all our expectations, and the same-day edit was a huge hit with all our guests! If you’re looking for someone to capture your special day, I can’t recommend Aman and Dipak Studios highly enough. 5 stars all the way!"],["Viha","5.0","Hands on with what they capture & the real emotions they can bring out in images. Kudos to Dipak Studios for their ability to put out instant images.Source"],["Onika Bishnoi","5.0","I feel elated in acknowledging the efficiency and professionalism of the team. With Rohit spearheading the coverage, the team ensemble was pretty great as they kept patience, with a dash of humour and creativity, and we are also impressed by the follow ups for the edits, and the uploads etc. The team made us laugh when we found ourselves exhausted and made us feel comfortable at all times. Thought I should put in a word of gratitude and give credit where credit is due. I’ve come to realise that how much the professionals have to endure, for weddings are a very anxious affair and our families too had such pangs of anxiety of getting everything done on time, of things being immaculate and these guys had to find their windows amidst all that to pull off their art, which I must reinstate was impeccable. \nThey were relentless in creating multiple pictorial canvasses of memories for us.  We look forward to more weddings in the family with the touch of Dipak Studios as we ourselves would recommend, although their work speaks for itself. \nThank you. \nOnika & Varun"],["Kritika","4.5","The photos turned out to be beutiful and also they gave the delivery on time."],["Garima Patodia","5.0","We had the best experience with Dipak Studios. Everyone on the team was incredibly warm and thoroughly professional. They made our wedding fun with their approach to content coverage. Raman Ji himself was involved from start to finish and he ensured that everything was executed smoothly. The entire team of photographers and videographers were a delight to collaborate with. What is even more appreciative is how quick they are in delivering on their work. My entire family is in awe of the pictures and we loved having them cover it for us.\n10\/10 recommend to hire Dipak Studios for all events! Great work, guys!!"]]},{"name":"Discovery Events","rating":"0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1489017367_1473690311_IMG_1643.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1489017367_1473690311_IMG_1643.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690435_IMG_1648.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690434_IMG_1647.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690433_IMG_1646.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690433_IMG_1645.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690432_IMG_1644.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690313_disc4.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690312_disc3.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690312_disc1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99669\/1473690311_disc_2.jpg"],"prices":"4,00,000","address":["Mumbai",""],"description":"Discovery Events is a young, dynamic and creative event management company based in Mumbai. They believe in the philosophy of extraordinary customer service and partnership. They have planned and designed many extravagant weddings and are also known to be the stellar planners behind Esha Deol’s wedding. Although their style relies on traditional and ethnic, they are also capable of adapting to your vision. Their work ethic and attention to detail has made them one of the most trusted wedding planning services. If you are looking for your own star studded wedding, look no further than Discovery Events.Services offeredDestination weddingWedding planningDecorEvent management","review":[]},{"name":"Focus Wala","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1695665295_CA_54.jpg?crop=7,46,2030,1142","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1695665295_CA_55.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1695665296_CA_56.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1695665296_CA_57.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1690858493_WLA_1086.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1690857408_WLA_1055.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1593443800_FWR_2179.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1667422733_image7706.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1595960202_image8794.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1646119730_WAG_2462.jpg?crop=28,52,2012,3025","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1597519434_image6871.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/442728\/1677396790_HAU_119.jpg"],"prices":"100,000","address":["Koramangala, Bangalore",""],"description":"With a glorious six-year presence in the wedding photography business, Focus Wala has emerged as a leading name in the industry. Nestled in the vibrant city of Bangalore, they take pride in capturing the essence of your special moments with their  unrivaled expertise and professionalism. At Focus Wala, they believe that every picture tells a story, and their trained professionals are dedicated to weaving those stories into timeless memories. With an unwavering commitment to perfection, they gladly undertake any pre-wedding or wedding project, ensuring that they are equipped with the latest photography equipment to deliver exceptional results.Services Offerd at Focus WalaCandid Photography: their candid photography skills are unparalleled. Focus Wala believes in capturing the genuine emotions and natural beauty of your special day, allowing you to relive those precious moments for years to come.Traditional Photography: Focus Wala's team of experts are well-versed in traditional photography techniques, ensuring that they capture the essence of your customs and rituals with utmost finesse. They understand the importance of preserving cultural heritage and present it artistically in every frame.Wedding Films: Focus Wala don't just capture photographs; they create cinematic wedding films that truly transport you back to the joyous moments of your big day. Their skilled videographers masterfully blend storytelling with stunning visuals to create a cinematic experience like no other.Albums: Focus Wala's meticulously designed wedding albums are a treasure trove of memories. They curate your photographs into stunning layouts that reflect the essence of your unique love story. Each page unfolds a new chapter, allowing you to relish your cherished moments in a tangible and timeless form.Maternity Shoots: Welcoming a new life into this world is a beautiful journey, and Focus Wala aims to capture the radiance and emotions of this phase through our maternity shoots. Their photographers delicately preserve the joy and anticipation, creating images that celebrate the miracle of life.Pre-Wedding Photoshoots: Before the big day arrives, let Focus Wala encapsulate the magic of your love story through their pre-wedding photoshoots. They offer a wide range of themes and locations to choose from, ensuring that your pre-wedding album is as unique as your bond.Fashion Photography: Their expertise extends beyond weddings. Whether you're a model, designer, or fashion enthusiast, their fashion photography services will beautifully showcase your style and creativity. From editorial shoots to portfolio building, Focus Wala has you covered.Latest Pricing and Portfolio at Focus WalaTo secure their services, they require a 50% advance payment. Focus Wala's pricing is tailored to suit your specific requirements, ensuring that you receive exceptional value for your investment. Please reach out to them for their latest pricing details. For a glimpse of their talent and creativity, they invite you to explore their diverse portfolio, showcasing the magic they've captured for their esteemed clients. Every image tells a unique story, reflecting the skill, passion, and artistry that defines Focus Wala.Does Focus Wala Travel to VenueAt Focus Wala, distance is never a barrier to preserving your precious moments. They undertake projects all over the country, ensuring that they capture your special day, no matter where it takes place. Please note that any outstation travel and stay charges are to be borne by the client.Trust Focus Wala to capture the essence of your most cherished moments. With their dedication to perfection, impeccable skills, and artistic vision, Focus Wala are committed to creating memories that will last a lifetime. Contact them today to embark on your journey to extraordinary photography experiences! Be sure to look at Focus Wala photos, cost, and reviews. ","review":[["mitesh k","5.0","This the in the most humble and honest tone possible. The album that was delivered and it's\nreally nice apparently can't wait to see it in person. Thank you so much for everything! \" It was amazing working with you guys and I always recommend working with y'all."],["Chaitra Raghunath Gardner","5.0","My mom is so happy that the your team were able to cover the venue, pooja items in so much details,She is recommending your team to all of her friends we had another small function before the wedding and we’re regretting not having your team photograph the event."],["Sahana Raghunathan","5.0","We do appreciate your work. We love all the photos and videos. Thank you so much. Wishing you guys a lot of success ♥️"],["Chaitra Raghunath","5.0","Sakshi and Ridhaan's team is truly exceptional! Right from the start, Sakshi exhibited a high level of professionalism and maintained clear communication. We are thrilled that we selected them to capture the memories of our special day. Their team was punctual and arrived precisely on time. They demonstrated an exceptional knack for identifying ideal locations to take our pictures, ensuring perfect lighting. They managed to capture all the ceremonies and intricate details of the decor flawlessly. We were immensely pleased with the high quality of their work. Their videography skillfully captured every aspect in intricate detail as well. To accommodate the challenges posed by the pandemic, we enlisted their services for live streaming the event at an additional cost, allowing those unable to attend to partake in our special day. We received commendations for the stellar streaming quality, with no disruptions reported. Overall, we were thoroughly delighted with the outcome of the pictures and videos. Thank you, Focus Wala for your exceptional work!"],["Meghna Vidyasagar","5.0","First and foremost, thank you so much for the amazing support you guys provided throughout the day!\nReally enjoyed posing after all thanks to your amazing team!"],["Poojitha","5.0","This the in the most humble and honest tone possible.\nThe album that was delivered and it’s\n really nice apparently can’t wait to see it in person. Thank you so much for everything! 💜 It was amazing working with you guys and I always recommend working with y’all."],["rony roy","4.5","Just want to say a massive thank you, you were brilliant! I love the photos, thank you so much! Just wanted to say a huge, huge thank you to you for being fantastic on our wedding day! Thanks again for the memories!"],["Aparna Goswami","5.0","Somehow the team found a way to capture every important moment on camera. I envy your skills and would like to thank you for doing such a great job for us!\nThis team is extremely talented , and we were thrilled with the results of your work."],["Keerthi Nagraj","5.0","You did an amazing job and I can't thank you enough! All of guests commented on what a lovely team you were and we got so many compliments about yourself. You made Nishant and I feel so comfortable on the day and we really appreciate it. \nWe couldn't have asked for anything better they're perfect!"],["Shamanth S","5.0","Just want to say a massive thank you, you were brilliant! I love the photos, thank you so much! Just wanted to say a huge, huge thank you to you for being fantastic on our wedding day! Thanks again for the memories!"]]},{"name":"Fotowalle - The Story Folks","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1455691241_17.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498631153_FM3A5711.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498631510_FM3A7678.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498630928_FM3A2146.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498636911_Image_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498633881_Z20A1015.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1455691241_17.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498633004_FM3A3008.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498634424_FM3A6089.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1498634882_Z20A9866.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1455691856_30.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/39302\/1461615222_Mallu_Wedding_35.jpg"],"prices":"300,000","address":["Delhi NCR",""],"description":"Fotowalle - The Story Folks are a husband-wife tag team who left their corporate careers to do what they do best - capturing special memories which people can cherish forever! They’ve only been in the business for 3 years but have covered the best of weddings from their base in Mumbai. Distance has never been a barrier for them from covering candid moments; they offer their services to couples all over India and abroad as well. Famous for their funky wedding video of Gursimran Khamba, they weave a story around the personality and essence of the couple and their respective families. In their own words,”Our passion leads us to transform stories into art. Our speciality is weddings and we have a methodical approach to all the madness they ensue!”Services offeredCandid PhotoshootTraditional PhotographyWedding AlbumsPre-Wedding Photoshoot","review":[["Aparna","5.0","Parag and Kanupriya from Fotowalle the story folks covered our wedding. They did an amazing job breathing magic into the most mundane moments. Both of them worked very closely with us and kept our personalities and vision in mind while shooting. They covered the gathering without being intrusive.Source"],["Chhavi Jain","5.0","Our multi-event festivities were beautifully captured by Fotowalle The Story Folks ). Parag and Kanupriya were truly very kind and took care of bringing our wedding vision to light through their amazing photography and videography. They were also very easy and fun to work with - something which is a boon for any couple undergoing these festivities.Source"],["Nanaki ","5.0","Cannot recommend them highly enough. The best and warmest people to work with. They went above and beyond to make our wedding photos memorable and a true representation of us.Source"],["Shruti Gochhwal","5.0","We chose them for capturing our special day. We couldn’t have asked for a better photographer. They are a team of highly professional and skilled photographers. They are dedicated and friendly. The photos we got are absolutely beautiful. They managed to capture the special moments from our big day perfectly. We got so many compliments about how the photos turned out to be so amazing. Highly recommended"],["Srishti","5.0","Fotowalle Parag and Kanupriya - I can’t even to explain the warmth Parag brought to the wedding. He was a true bridesmaid through the process of planning this wedding. I began speaking to him before COVID hit India, so we’ve spoken in depth about all possibilities of this wedding and what could go right and wrong.Source"],["Pranati","5.0","They have been amazing. So fun to work with. So chilled out and cooperative. And the photos have come out amazing. Very happy with the pictures.Source"],["Rupani","5.0","Chirag and I met them once and we knew we wanted them for our wedding. They are undoubtedly the best. Parag and his entire team made us feel so comfortable that even the awkward couple posing pictures were full of laughter. I love how easy it was to work with them even after the wedding. All our post wedding work was handed over to us exactly on time. Extremely professional and so much fun. Definitely made friends for a lifetime.Source"],["Aanchal Tuli","5.0","Fotowalle: I have known Parag and Kanupriya for a very long time and I'm so glad I could have Parag shoot our wedding. He was like a family member throughout!Source"],["Snehal","5.0","Fotowalle  were the first choice for photographers. I have always loved their work and have been following them for way too long. There were no two ways about that, that only these guys were going to do my wedding. They’re the experts when it comes to clicking candids and that’s exactly what I wanted. Pure love for their work.Source"],["radhika bhutani","5.0","Had the best time with this team! They captured each moment perfectly without us knowing. My husband is a terrible poser, and they brought out the best in him :)Source"]]},{"name":"Framed","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/vendor_cover_pic\/22316\/49cac208-2a13-41ff-a279-fb1854b88c1d.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540567056_Pre_wedding_37.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540567119_AA0I8731.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540613467_pre_wedding_16.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1538216516_13.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540566993_Portfolio___horizontal_058.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540566995_Pre_wedding_57.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540567183_Pre_wedding_12.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540628921__42A8043.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540629163_IMG_2617.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540613311_Pre_wedding_3271.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/136866\/1540613227_Gettting_Ready_4.jpg"],"prices":"On Request","address":["Bhowanipore, Kolkata",""],"description":"Framed is a wedding photography service based in Kolkata established in 2014 and is associated with WedmeGood since more than a year. Ensuring people remember the best days of their life through memories the team of photographers at Framed provides excellent photos and videos. Capturing every occasion with perfection, their aim is to depict your stories through their work. Their technical creativity is unmatched ensuring to give best quality pictures for every function from pre-wedding shoots to post-wedding celebrations. Giving every occasion the importance it truly deserves, the team promises you excellent quality, presentation and value for money. They are a great option to hire for your wedding photography making it a fun and wholesome experience.Services offered:Pre-wedding shoots Wedding photography Candid photography Studio photography Cinematography Wedding albums Travels outstation ","review":[["Komal saboo","5.0","We couldn't have selected anyone better for our big day. You guys made sure that everything was more than perfect. 5 stars aren't enough to express the kind of shots you have captured. Everything was seamless and I would like to recommend it to everyone who wants the best moment of their life to be captured in a special way. Pictures are memories forever and I am so glad that I have such beautiful ones. All thanks to the team of Framed, just love the innovation that these guys have. A special thanks to Ronak for being so patient with us.\nThank you for making my wedding so special."],["Pragati Mahansaria","5.0","Tell them what you want, and they do it for you in an exact way, in fact you will get an output even better than that. The ease with which they shoot the video is commendable and the comfort that team Framed provides is the most amazing part. The relationship we share with Ronak and his team is not the customer service relation but much beyond that. We are extremely overwhelmed by being associated with Framed. Thank you for the amazing pre-wedding video and the moments captures of our pre-wedding !!"],["Ruchika soni","5.0","Cheers to an amazing team@framed specially \nRonak Gadhia and Jai Gadhia.you guys are really friendly and Cooperative \nYou guys are have done an phenomenal job at the shiru wedding \nWe can't get over glancing at the photographs and the videos. May you guys keep succeeding and soon we again get a chance to be with you and your team and Big cheers to the FRAMED team. \nWe could not have selected anyone better team for our big day. Can't express the kind of shots you have captured. I would recommend people to choose them as the part of their big day too. \n \nI thank you for making my wedding so special and thanks to my brother who made a really good decision in booking you guys.  "],["Chhavi Garodia","5.0","5 stars aren’t enough to tell you how happy we are that we booked you and your team for our wedding. Probably the best decision ever! \n\nNikunj and I are do not like posing and getting too many pictures clicked. But trust me, you guys made us want to do all of it! \nIt was such a beautiful experience. \n\nYou guys are fantabulous (yes, it is a word :p). The whole process was so much fun. Clicking a zillion pictures, posing, the video shots, squeezing in time to get every possible picture, photoshoot at 1:30am and most importantly the seamless blending of a professional relationship into a bond of friendship. All of it! \nObviously, I ll be able to say more once I look at the photos, which I am sure will be amaaazinggg given how pretty I am �! \n\nWe did see sample with the wedding teaser you gus gave us in extremely short notice of 2 days. It was just so so beautiful. I almost cried! \n\nHands down, we have to thank you for all of it! And your team as well. Brilliant you guys are! \n\nLots of luck for all the future adventures \n\nCheers! \nChhavi & Nikunj"],["Kritika Hamirwasia","5.0","Truly one of the best photography I've ever come across. You've captured the best moments for us, and your creativity is totally a dazzler to the eyes. I'm so so glad for choosing you for my sister's engagement photography, can't thank you enough, Ronak! :)"],["Vinita Saboo","5.0","One of the best choice we made for our Big Day. Most humble , friendly, sweet and highly professional photographer. \nThank you for giving us the best of memories. Pre-wedding till wedding shoot was super fun experience with the entire team.\nYou guys are doing a great job. Keep rocking! Good Luck:)"],["Modak Sarda","5.0","In the process of shortlisting a photography team for our wedding, we came across FRAMED. We liked their work and wanted to have a meeting to see if things could go forward. We saw some more of their photography and videography skills and freezed on them (so glad today that we did it). Wedding took place at Ibiza, outskirts of Kolkata and the entire event was shot by their very enthusiastic and equally skilled team. A wedding is a once in a lifetime event and FRAMED nailed it completely for us. From amazing captures to amazing angles to amazing monochromes to awesome videos, they made it all worth the wait. They very patiently handled and took care of our requirements and at the end of a day, did a FAB work. Totally recommend the team at FRAMED if you are looking at once in a lifetime capturing of beautiful memories to cherish all your life!!! Take a bow, team FRAMED!!!\n\nP.S. This Ronak guy is really good at making you comfortable and is a great friend to have at the end of the day. So along with a fab job, you also get a fab dost (woh bhi free free free, despite him being a gujju mind it)..."],["Yoshita Saraf","5.0","A great team of photographers. A must book for all people who getting married and looking to get their moments captured in the best possible manner. :)"]]},{"name":"Hair and Makeup by Reena and Riya","rating":"0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_18_46_59.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838810_24899683_525743657811922_348768475639731442_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_19_08_15.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_19_08_00.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_19_08_00__1_.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_18_49_48.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_18_46_57.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/798546\/1571838729_PHOTO_2019_10_23_18_46_59.jpg"],"prices":"7,500","address":["North Goa, Goa",""],"description":"Hair and Makeup by Reena and Riya is a Goa-based professional Makeup & Hair Artist. They specialize in providing their services customized for occasions like weddings, engagements and social gatherings. Because of their experience in the industry, they have learnt the attention for detailing along with distinctive creativity. Always paying keen attention to your skincare and skin type, she only uses high-class products. Rather than projecting convenient designs on your face, she enhances your natural features and believes in doing it according to your demands. Their effective techniques and innovation are the key to their magical makeovers and gasping transformations.Specialization :Bridal makeupWedding makeupPre & Post wedding makeupEngagement makeupParty makeupHairstyling","review":[]},{"name":"House On The Clouds","rating":"5.0","images":[],"prices":"125,000","address":["Bangalore",""],"description":"The wedding day is one of the most precious days in one’s life. To capture all the bittersweet moments, the joys, the sorrows, the anxieties, the fun, and the laughter, it is important to hire a wedding photography and videography team who will do the job well. If you are a soon-to-be-wed couple in Bangalore, then House On The Clouds by Siddharth Sharma is a great option for you.House On The Clouds is a studio based out of Bangalore. This is a team of ace cinematographers and wedding filmmakers with an experience of two years in the industry. In fact, they have also been awarded the ‘Wedding Filmmaker of the Year’ at the Wedding Sutra Awards, 2018. Their venture is one that takes a modern approach to an age old tradition. With a creative perspective and a keen view to capture the best of the best moments, House On The Clouds has a unique outlook, allowing the preservation of your priceless memories and emotions for you to cherish forever.By The Team“We are wanderers, explorers of light, driven by a strong desire to capture fleeting moments onto frames and stitching them together to create a visual symphony which is both organic and timeless. We do not follow trends and have our own unique non-linear approach of presenting stories. Our wedding films are carefully crafted to blend traditional with modern, combining stunning visuals with creative storytelling.”Services Offered by House On The CloudsHouse On The Clouds offers a wide range of services related wedding to cinematography and photography. Some of these include:Save The Date videosWedding FilmsTeaser VideosStill PhotographyWorking StyleHouse On The Clouds has a modern approach to weddings, with the videos centred entirely around content and visuals, rather than trends. A beautifully edited feature film takes about three to four months to be delivered to you, and is generally of 25-30 minutes duration. You will also receive a 5-minute cinematic trailer. Further, the team travels all around the world, so even if your wedding is not in Bangalore, do not worry!If you are pleased by House On The Clouds, then contact them at the earliest for your wedding day! You may browse through the portfolio of the team on the WedMeGood portal for a clearer picture (quite literally!).","review":[["Aasheekaa","5.0","House on the the Clouds completed my dream wedding team. They are simply magic! Again, I was blown away by Siddharth’s humility. They were present throughout the weekend and were always fully on. I didn’t give them any direction - just told them to do what they do best, which is poetry in motion.Source"],["Naina Reddy","5.0","After much online searching and looking through millions of videos and pictures, I found House on the Clouds through WedMeGood. Their unique, cool, and modern style is exactly what I wanted to capture our wedding story. We had so much fun working with them from the pre-wedding shoot and through all the wedding events. So far we have come upon some epic and emotional photos and their videography of our sangeet was exactly what we wanted! I cannot wait for our wedding trailer!!Source"],["Shloka","5.0","After much online searching and looking through millions of videos and pictures, I found House on the Clouds through WedMeGood. Their unique, cool, and modern style is exactly what I wanted to capture our wedding story. We had so much fun working with them from the pre-wedding shoot and through all the wedding events. So far we have come upon some epic and emotional photos and their videography of our sangeet was exactly what we wanted! I cannot wait for our wedding trailer!!Source"],[" Ishita ","5.0","I wanted someone to capture the wedding memories that can be treasured and stays with me forever. Somebody who can enshrine our beautiful story through the lenses. When I saw the house on the clouds work, I knew it has to be them or no one else (and I mean that, I never had an option for second best in my list). I remember how unsettling it was until I got a response from them that they would be a part of our wedding in Shimla. Words cannot justify the work, the art and the ethics of the house on the clouds. Those who could not attend our wedding, when they look at the wedding pictures, they feel they were actually a part of the marriage. They captured not only the people but also the emotions, and that is priceless!!Source"],["Malavika","5.0","The House On The Clouds guys were amazing ? the value addition from the slow motion booth was both fun for guests and hilarious in the final video\nThe albums and still pictures and stunning. Memories worth a lifetime captured there naturally.Source"]]},{"name":"ITC Gardenia","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1431515181_ITC_Gardenia_003_jpg?crop=59,136,788,443","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1489011838_1453926734_Mysore_Hall___Cluster_Setup.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1453926784_ps_bedroom.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1453926783_Lobby__View_Point_2_.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1453926783_gardenia_exterior.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1453926782_Gardenia_4.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1453926781_Bedroom_Upstairs_Peacock_Suite.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1431953288_entrance_lobby_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1431953288_banquet_pre_function.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1431515182_ITC_Gardenia_004_jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1431515180_ITC_Gardenia_001_jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/13069\/1431515178_ITC_Gardenia_jpg"],"prices":"3,000","address":["Bangalore","Ashok Nagar, Bengaluru, Karnataka 560025"],"description":"ITC Gardenia embodies the splendors of Nature. This luxury hotel in Bengaluru was built as a tribute to the beautiful city of Bengaluru, inspired from the magnificent gardens of the city. The hotel is conveniently located in the commercial heart of Bengaluru and is in close proximity to key business districts and IT hubs of Bengaluru.They have 2 areas available for such as their Lawn which can accommodate 120-300 guests and their Hall which can accommodate anywhere between 330-550 guests. This luxury hotel, ITC Gardenia in Bengaluru is equipped with 292 luxury rooms and suites offering the discerning business and leisure traveler the best in hospitality and hotel servicesSpace Available and Capacity in ITC GardeniaThey have an open lawn as outdoor venue that can accommodate 120 (seated) and 300 (floating) guests. The hall can accommodate 330 (seated) and 550 (floating) guests, perfect for a grand wedding or pre wedding function like cocktail, sangeet, mehendi.Facilities Available at ITC GardeniaWith space preferences including Outdoor spacing, they have 292 rooms available. They also provide a range of enlisted panel of decorators to add to the ambience as well as includes flexible DJ policy, this venue marks itself as a suitable place for your functions. They offer great hospitality and ensure none of your guests are unattended, making it your ideal pick. Offering a spacious area for all wedding festivities they also offer in-house catering, and provide inhouse decor, with inhouse alcohol , all under one roof, perfect for your special functions.CuisinesThey have their own catering facility offering delicacies that are worth every penny. Both non vegetarian and vegetarian food options are offered. They provide inhouse alcohol as well, making them a perfect choice for your special occasion.LocationThis property is located in Ashok Nagar, Bengaluru, and is well equipped with facilities that redefine the comfort with elegance and efficiency. It is an easily accessible venue.Other services offered by ITC GardeniaThey have an extremely hospitable and well trained staff who work to make your day even more special. This sophisticated wedding venue is an impeccable place to host your big day ceremonies, pre-wedding and wedding functions, receptions, opulent gatherings, making it perfect for your special occasions.A Luxury Hotel, They are the perfect and a great choice for you. The venue has a great hospitality and ambience making them a one stop shop for your functions. Good places get booked early, so take your chance now! You can easily look and book them at WedMeGood.","review":[["Ajay","5.0","We attended a wedding here and loved the experience. This is one of the finest hotels in bangalore and the service is 10\/10. Must viist property"],["Manya Rao","5.0","I had 2 events in ITC Gardenia, Mehendi and Sangeet. One was indoors and one was outdoors. Both were a grand success. The food was outstanding and the service is unmatched."],["manya","5.0","We loved the hospitality and professionalism of ITC. Food was amazing and everything was managed really well. Mr Ankush Punjabi from ITC helped us manage the occasions really well. We had our mehendi and sangeet there and both occasions were a great success."],["aakansha","5.0","It was a very pleasant experience.\nBecause of Covid my wedding reception got postponed. But ITC Gardenia refunded the full amount.\nThey accommodated us again at short notice for the rescheduled dates.\nITC Gardenia location itself ( Central Bangalore) makes it an ideal place for guests from all parts of Bangalore.\nA special shout out to Mr Syed Tauseef Ahmed Catering Sales Manager who eased things for us.\nWe chose The Mysore Hall, Magnolia and Plumeria for our 300 guests ( Covid government restrictions) and the food ( Continental \/ North Indian) was excellent.\nThanks to all at ITC Gardenia for making our day extra special!"],["Divya ","4.5","After some initial hiccups the management at Itc really came through for us. We had a beautiful brunch at the lotus pavilion which our guests were raving about !"],["Naina Reddy","5.0","Our venue was ITC Gardenia and I have to say, just like Jay and my relationship, it was truly fate that made this gorgeous and hospitable hotel our hosts. When I walked into ITC Gardenia, I was literally transported from to a beautiful airy garden. From the open layout of their lobby, to the mouth-watering food (hats off to Chef Papa Rao), ITC impressed us and every single one of our guests. Their staff and leadership went above and beyond in accommodating us and while we did hit a few hiccups and hurdles, they did everything to make sure we left wanting to return. With picturesque interiors, welcoming staff, and luxurious accomodations, ITC really made the wedding a memorable one for our familes and friends.Source"],["Shloka","5.0","Our venue was ITC Gardenia and I have to say, just like Jay and my relationship, it was truly fate that made this gorgeous and hospitable hotel our hosts. When I walked into ITC Gardenia, I was literally transported from to a beautiful airy garden. From the open layout of their lobby, to the mouth-watering food (hats off to Chef Papa Rao), ITC impressed us and every single one of our guests. Their staff and leadership went above and beyond in accommodating us and while we did hit a few hiccups and hurdles, they did everything to make sure we left wanting to return. With picturesque interiors, welcoming staff, and luxurious accomodations, ITC really made the wedding a memorable one for our familes and friends.Source"],["Nikhita Kishore","4.9","I booked this venue for my wedding function and the Decor was very good and quality of food is amazing. The presentation was really well done!!"],["Amy","5.0","I stayed at the ITC Gardenia for a wedding in March. It was amazing, the grounds were impeccable, clean and gorgeous. The rooms were spacious and luxurious (very comfortable bed and pillows!). The food was delicious, I will miss the vast breakfast buffet for the rest of my life. Above all else, the staff was amazing! Swathi and Arti get special commendation - what friendly, lovely and helpful hosts they were! If we needed anything or had questions, they were there immediately to help. I give them a 10\/10 and wish all hotels had such a helpful and wonderful team!Source"],["Nusrat","5.0","We had all our 4 wedding events at ITC Gardenia and everything from the food to the organization went without a glitch! Every single person at ITC was very helpful and the service was just impeccable. Compliments to the amazing chef, Prashant for creating such diverse and delicious menus for each of the events. Quick shout out to people we interacted most at ITC - thank you, Shivangi Bhatia, Vikek Batra, Arun Kaul and Swati Ullal for making ours and our guests' stay really comfortable and memorable! Thank you for everything!Source"]]},{"name":"LightBucket Productions","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1694620784_DSC06021.jpg?crop=80,213,1910,1074","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1720795035_ROH06719_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1720794935_01_02.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1720795272_Z62_2620_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1574918880_0C6A2641.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1720794957_JGF19117_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1557124438_WX4A6834.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1707845879_VIN02407.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1557124400_1.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1581160044_4F7A9383.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1707845879_ROH09060.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/16201\/1581513453_6O4A1348.jpg"],"prices":"125,000","address":["South Bangalore, Bangalore",""],"description":"LightBucket Productions is a wedding photography and videography venture based out of the city of Bangalore. LightBucket Productions believes in telling beautiful stories with the click of their camera. Comprising of a passionate, enthusiastic and artful team of creative photographers, cinematographers and editors, they have successfully covered over 300 weddings. Constantly exploring unconventional and creative ways to tell your wonderful story, they bring in a uniqueness in all their work that will be deeply appreciated and highly cherished by you.The heartfelt pictures and visuals received are a true indication of the team’s effort. LightBucket Productions puts their heart and soul to help produce memories that are the purest reflection of the moment, capturing not just what’s noticeable, but also that which often goes unnoticed. The promise is finely detailed, timeless visuals from your special day which you are bound to love.Services Offered by LightBucket ProductionsLightBucket Productions offers a range of services to take care of all your wedding photography and videography needs, such as:Candid PhotographyTraditional PhotographyCinematographyPre-Wedding ShootsWedding AlbumsViewing LightBucket Productions extremely impressive portfolio as uploaded on the WedMeGood portal is sure to give you a good idea of their style of photography. With over 300 pictures to scroll through, you can make a proper judgement. And if you are from outside Bangalore or are planning a destination wedding, then worry not-- LightBucket Productions is happy to travel across the world to capture your finest moments in the finest fashion. For more details, please contact the team.","review":[["Dhruvi ","5.0","LB has been on my wishlist since 2016.\n\nWhen I got engaged in 2023, LB was the first vendor I booked. As a wedding planner myself, I can be a demanding client. As the event approached, I had some doubts and reached out to one of the founders. I'm so grateful they supported me through it.\n\nLB exceeded all my expectations. I wouldn't have such beautiful memories of my wedding without them. \n\nI can't thank Sumanth, Vinay, and Akash enough for everything they did for me. The editing team, Tamana and Sanjan, were exceptional, understanding my vision and going beyond their usual edits to ensure my satisfaction.\n\nI wholeheartedly recommend LB Productions for your big day. They truly go above and beyond.\n\nWith love,\nSwathi❤️"],["Sagarika ","5.0","Rohan , Akarsh, and the whole team- amazing peeps and cooperative throughout the process, extremely kind, and professionalSource"],["anushri sarathy","5.0","Such amazing photographers and such a good team! Best decision of choosing them. They capture such good candid as well as portrait pictures. Absolutely wonderful clicks. Highly highly recommend these guys! \nSpecial mention to John, Rohan and their team for capturing our beautiful moments that we will cherish for a lifetime!"],["Ashutosh Tewari","5.0","I recently had the pleasure of choosing Lightbucket for my wedding, and their team was excellent. From start to finish, they executed every task with impressive precision and punctuality. The photographers were professional, capturing every moment beautifully and ensuring that no detail was overlooked. Their creativity and attention to detail were evident in every shot. We received our photos on time, perfectly edited, and they truly exceeded our expectations. "],["Aishwarya","5.0","The Lightbucket team was amazing; they felt like family.Source"],["Surbhi Acharya","5.0","I could not have imagined having a better photographer for my wedding day! Not only was the final product AMAZING, Folks from Lightbucket Productions were a pleasure to work with from the moment we booked them to the delivery of our wedding photos and photo book. Sumanth & Akarsh truly have an eye for capturing each special moment throughout such an exciting day. Not only is Lightbucket's work product fantastic, they are such fun to be around and they made the entire process exciting. My husband and I could not be happier with our choice to have Lightbucket Productions photograph our wedding day!"],["Pratyush Padmanabhan","5.0","I had the pleasure of working with Lightbucket Productions for my wedding, and I couldn't be happier with the results. Their team captured every special moment beautifully, and the final video exceeded my expectations. They were professional, creative, and truly understood our vision. I highly recommend them for anyone looking for top-notch wedding videography. Thank you for helping us relive our special day!"],["Reshma Prasad","5.0","My husband and I chose Light bucket productions for our wedding events in Dubai and Bangalore, and it was the best decision we made. The team - Sumanth, Vinay, Akarsh, and Clinton - were fantastic. They captured every event, from the colourful Haldi to the lively Sangeet, the beautiful wedding, and the fun Reception, with such skill and care.\nThey didn't just take pictures; they told the story of our wedding. Every photo from our post-wedding shoot was filled with love and happiness, showing just how well they understood what we wanted. They even made our wedding albums, and the quality was amazing. They were patient with us, always ready to make changes or answer our questions.\n\nWhat really impressed us was how they captured our families in the photos. They caught all the important moments, the laughter, and the tears, making every picture feel special.\n\nIf you're looking for a photography team for your wedding, Lightbucket Productions is the one to go with. They're not just good with their cameras; they're great with people, making sure they capture all the joy and emotion of your big day."],["Prajna Rai","5.0","Having Sumanth as our wedding photographer was the best choice my husband and I made. Our family didn't believe he flew in just for our wedding! Sumanth was extremely professional, very attentive and was able to handle our very big wedding party and family. The images he captured were exceptionally beautiful, he was able to get moments that truly captured the essence of our personality and wedding. I think we will need re-new our vows every year just to have Sumanth come back and capture moments for us :) \nThank you Sumanth & Lightbucket Team!"],["Karthik Hariharan","5.0","The team at Lightbucket Productions made sure we were all in this together! Sumanth & Akarsh covered our wedding and engagement ceremony and they made sure to capture the best moment with us. Producing high quality work, the best part was the ease with which the team worked with us throughout our ceremonies gave us much needed confidence in the process. We knew we were in the right hands.\n\nHighly recommend the team for cinematic shots and videos that made our moments even more special. If you are looking for a professional and talented team that knows their job without getting in your way (belive me we have seen photographers taking fun out of the process!) then you will not be dissapointed. Terrific work!"]]},{"name":"Love Collective","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672165971_SLH_4096_Edit.jpg?crop=7,125,2034,1144","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672167023_SLH_1860.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1671691882_5_copy_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672165079_CHA_1017_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1561957390_62631247_459760618143342_3235553454269835423_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1671691873_5_5.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1671691889_6_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672165894_RAV09588_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672166910_SLH_1343_min.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672165065_CHA_1352_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672165075_CHA_1439_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/581837\/1672167035_PRA_5739.jpg"],"prices":"45,000","address":["Banjara Hills, Hyderabad",""],"description":"LoveCo Photography is a wedding photography service that shoots the various frames of brides and grooms along with their family and friends during their wedding festivities. They are sure to provide an unmatched level of quality services pan India.Working Style of LoveCo PhotographyThe panel at LoveCo Photography consists of experienced photographers, designers, movie makers and creative directors whose skills and creativity are always on track to make your wedding ceremonies even more special by making time stand still with their craft.LoveCo Photography is led enthusiastically by its leaders, who ensure that quality of service is not compromised at any task they take up. They have been in the field for over 5 years and is marching forward strong. The pioneers of this brand ensure that the quality of service is of the best standards.The team at LoveCo Photography love to click the beautiful chaos during the wedding festivities of a person's life and delivering them in a format that they and their coming generations can look back at and rejoice. Immaculate presentations of their striking photo captures are a consistent part of their wedding services to leave their customers astonished.Services Offered by LoveCo PhotographyThere are various services offered by LoveCo Photography for a number of wedding festivities such as simple home engagements before the wedding to large scale wedding ceremonies. The services offered are :Candid PhotographyTraditional PhotographyTraditional VideographyCinematic VideoPre Wedding ShootsPre Wedding FilmsMaternity ShootsModel photographyLoveCo Photography have proved that they are the utmost professional team present in the region by providing on time performance and delivery at the past weddings they’ve captured. Their patrons cannot recommend them enough for other events to their friends and family.Travels To The Preferred LocationThe well-equipped photographers from LoveCo Photography are ready to travel to your preferred wedding destinations and provide their exceptional talents of freezing moments in time with their wide range of services for your wedding ceremony, or any events related to it at your convenience.LocationLoveCo Photography is based out of Hyderabad, in the state of Telangana.Give the creative team at LoveCo Photography the honour to freeze and capture the precious moments of your wedding celebrations.","review":[["Aishwarya","5.0","They are the team who exactly delivered what I had wished to have for my wedding. They captured the beautiful candids and moments, which made me feel quite emotional after reviewing everything.Source"],["Monica","5.0","The team is very professional and they click amazing pictures. Totally totally worth it! Had a fab experience with them"],["Rachana","5.0","We did our pre-wedding photo shoot with them. Photos and videos came out perfect and we loved shooting with them. We wish them all the success for their future."],["HarshaVardhan","5.0","Team LoveCo is all one can expect from a photographer. Right from our pre wedding photoshoot until our last wedding event, the process was smooth and sound. They are an energetic bunch of young, passionate people, who go the extra length to get the perfect shot and take. Very glad to have chosen them as the photography partner for our wedding. Thank you Team LoveCo!"],["Akash","5.0","We did our pre-wedding photo shoot with them. Photos and videos came out perfect and we loved shooting with them. We wish them all the success for their future."],["anjani","5.0","A big thank you to the amazing team for making our day memorable. They did a great job with lots of uncertainty, ups and down and all. Team was always on their toes for capturing all the moments. They encouraged us to be ourselves as a couple so that, they bring out the best moments. Great quality of work."],["Shruti","5.0","I’m so glad I chose them for my wedding photography and cinematography. In your team photographers and cinematographer were so friendly and professional and really did an amazing job! I would 10\/10 recommend."],["Rachna","5.0","Team did a great job capturing our wedding. The output was exactly how we wanted it to be, especially the videos which captured all the candid moments from the wedding beautifully. Would definitely recommend them."],["yukti","5.0","It was good to see the team receiving multiple appreciations. Comes with efforts and is based on the output. They truly made our special day very memorable. Wishes you all the best for your further projects."],["Shilpa s","5.0","Extremely happy with the services provided by the team for my Wedding ceremony. The entire process from booking to delivery was very professional .They captured beautiful memories of the event with no intervention from our side.Thank you Love Collective"]]},{"name":"Magic Motion Media","rating":"4.6","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050211_image7275.jpg?crop=185,35,976,549","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050173_image6871.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1539937361_image3868.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050213_image4556.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1539939940_image6001.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050174_image8267.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1540019296_image179.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1539937398_image4955.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050191_image2142.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050175_image4212.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1542050175_image7984.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/434553\/1539939869_image8590.jpg"],"prices":"90,000","address":["Palluruthy, Kochi",""],"description":"Founded in 2015, Magic Motion Media has been at the forefront of providing top-notch creative and conceptual experiences. With a rooted instinct for capturing real-life moments that build lasting memories in the hearts of their clients, they have become a trusted name in the world of photography and videography. Based in the picturesque city of Kochi, the team of phenomenal and gifted experts works tirelessly to deliver the highest levels of client satisfaction and exceptional results.The Approach at Magic Motion MediaAt Magic Motion Media, they understand that your special moments deserve to be cherished forever. That's why they offer a range of services that cater to different occasions and requirements. Their expertise lies in wedding photography, where they specialize in capturing the joy, love, and emotions that make your big day truly unforgettable. From pre-wedding shoots that beautifully depict your journey as a couple, to candid photography that captures the spontaneous moments filled with laughter and tears, they ensure that every detail is preserved in the most artistic and authentic manner.Services offered at Magic Motion MediaIn addition to wedding photography, they also excel in traditional photography, which celebrates the cultural and religious aspects of your special day. Their talented team understands the importance of cultural rituals and traditions, and they skillfully capture these moments with the utmost respect and sensitivity. They believe that your story should be told through stunning visuals, and their commitment to excellence shines through every photograph they capture. For those who prefer moving images, their cinematography services offer a cinematic experience that brings your memories to life. With a keen eye for detail and a passion for storytelling, their cinematographers craft beautiful films that encapsulate the essence of your wedding day. From capturing the grandeur of the venue to the intimate moments shared between loved ones, their videos will transport you back in time, allowing you to relive those precious moments again and again. Magic Motion Media is not just limited to weddings; they also cater to other special moments in your life. Their maternity shoots capture the beauty and anticipation of pregnancy, creating timeless images that you can treasure forever. They understand the significance of this life-changing journey and ensure that every photograph portrays the joy and excitement that comes with expecting a child.Travel to VenueTo provide convenience to their clients, Magic Motion Media are prepared to travel to any venue, whether it's within Kochi or beyond. They are well-equipped and experienced in handling outstation projects, and while travel and stay charges are borne by the client, they guarantee that the quality of our work remains uncompromised, regardless of the location.Delivery timeAt Magic Motion Media, they value the trust you place in them, which is why they strive to deliver your finalized photographs and videos within a reasonable timeframe. They understand that anticipation can be high after your special day, and they work diligently to ensure that you receive your memories within 8 weeks of the event.With their dedication to excellence, a passion for storytelling, and an unwavering commitment to client satisfaction, Magic Motion Media is here to create timeless memories that you and your loved ones will cherish for a lifetime. Trust them to capture the essence of your special moments, allowing you to relive them with joy and nostalgia for years to come. Be sure to look at Magic Motion Media cost, price, reviews and photos. ","review":[["Neha","5.0","We connected with the Magic Motion team four months before our wedding, and their seamless process in Dubai made planning effortless. They perfectly understood our vision, and from the start, their shoot plans and creative ideas aligned with our expectations. Meeting them in Shimla felt like reuniting with family—Alex and Abin, especially, became like brothers. The final results were stunning, and we couldn’t be happier with our choice!\nSource"],["Shivani","5.0","They were an amazing team, super involved in everything.Source"],["Divya","5.0","Another amazing team. Everything was seamless. The photo video output brings us so much joy every time we see it and it really is a testament of how good a team they are.\n\nSource"],["Keya Bhatia","5.0","Super warm and friendly making the 2 of us (who hate taking pictures ) feel super comfortable and the pictures have turned out amazing.\n\nSource"],["Anonymous","5.0","Magic Motion Media are an amazing team of photographers.\n\nSource"],["shreya mago","5.0","They are truly great at capturing the wedding. From candid shots to beautiful portraits they do a great job. The team is so warm and comfortable which makes the overall experience great!\n\nSource"],["neha nazer","5.0","Have to admit \nMagic motion media has the best clients service , Glad we went with best decision choosing magic motion media for our special day❤️"],["Nina Yunus","5.0","It was overall a great experience working with the team.!"],["Athila","5.0","I had a Really Good experience working with the team "],["Mariam Faizal","5.0","Fantastic experience! My husband and I were really pleased with Magic Motion’s creativity and dedication to our photo and video shoots. We would like to thank our creative director Josey, photographers Noufal and Niyas, and editor Anfal for their hard work in capturing our fairytale wedding."]]},{"name":"Mallu Farms","rating":"4.8","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/project\/243874\/1702023165_S_R_Wedding_01_00079.jpg?crop=191,403,1711,962","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/rotated_1650266707.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425874_IMG_20230804_WA0040.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1682414447_IMG_20230414_WA0064.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1650266647_IMG_20220208_173229.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425780_3P7A1669.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425872_IMG_20230804_WA0055.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425876_IMG_20230804_WA0044.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425845_S_R_Wedding_01_00060.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425869_IMG_20230804_WA0011.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1581677260_2B6A9682.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/99817\/1692425874_IMG_20230804_WA0051.jpg"],"prices":"2,500","address":["Chattarpur, Delhi NCR","Mallu Farm, Ansal Villas, New Delhi, Delhi, India"],"description":"Mallu Farms in Chattarpur is known for its ambiance and style. With plush surroundings just suited to make your occasion very special, memorable, and absolutely personalized. Located in the heart of South Delhi, The venue offers a beautifully decorated hall to provide the perfect ambiance for the once-in-a lifetime event. There is always uninterrupted power backup at hand so that the lights never go out on the big night. They also offer the most beautiful and exquisite catering, staging, and other decoration facilities that make the venue look delightfully pretty for every event. Ample parking is also available.Space and Capacity Available at Mallu FarmsThe venue has four spaces available, all of which are a mix of indoor and outdoor spaces. Whether your guest list is 500 people or 3000 people, they have the perfect venue area for you.Imperial Hall: This is the smallest venue option of the property. It can host about 500 people at the same time and is perfect for hosting pre-wedding functions.Windsor Hall: This venue option can host almost 500 people at the same time. Ideal to host a wedding ceremony or a reception partyBali Lawn with Pool: With 225 seats and 500 Floating, it is a perfect spot for your cocktail and sangeet function.Hawaii Lawn: The largest venue option on the property, it can easily cater to 700 guests at the same time. It is a perfect option for you to host a grand wedding or a reception party.Cuisines available at Mallu FarmsThey take pleasure in presenting you with a diverse menu that includes a variety of items that are an eclectic mix of Indian, Chinese, and Continental cuisines. All dishes are prepared to order using only the finest and freshest ingredients and are prepared under strict hygiene standards. However, if you have special preferences for catering, you are free to choose any that you like.Facilities Available at Mallu FarmsThey are an ideal wedding venue for those who want a hassle-free wedding experience. Due to a strict policy that only allows employed decorators, they ensure that your special day is decorated by the best in the business. The in-house DJ ensures that the entertainment is top-notch and your guests are grooving to the latest tunes. The venue offers ample parking space, including the convenience of valet parking, ensuring that your guests have a stress-free arrival and departure. With its beautiful and spacious setting, it is the perfect wedding venue for your special day.Location of Mallu FarmsLocated in the heart of South Delhi, they offer a beautifully decorated hall to provide the perfect ambiance for your big day.Latest Pricing & Photos of Weddings at Mallu FarmsIf you are looking for a hospitable place with great service for you and your guests, this is the place for you. It is one of the perfect venues to host all kinds of ceremonies or celebrations. They will ensure that your celebration, is eventful and worth remembering for a lifetime.Explore the Mallu Farms reviews and photos section and finalize the venue if you feel that their quality of service is up to your satisfaction. Contact them to know the prices and wedding packages.","review":[["Aakanksha Sardana","5.0","The venue completely met our vision for our event. We visited a winter evening while the sun was almost setting and could picture the entire event happening just as we had imagined. The natural aesthetic of the venue and the beautifully maintained garden complimented what we had in mind. And even on the day of the wedding, every member of their team was hospitable and ensured the best service. There was even a team making sure that we ate! They adjusted to our timelines and were accommodating about menu changes. The food was great and our guests have been praising it even months after.Source"],["Jatin Kaushal","5.0","Just wanted to give a shoutout for hosting my friend Vibhay's wedding - it was incredible! The vibes, the setup, everything – just perfect. You guys rock!"],["Aakanksha Verma","5.0","I had my wedding at the Bali Lawn in Mallu Farms and it was a great event. The management team at the venue are super responsive and go out of their way to ensure that your event is a success. The in-house vendors for catering, decor, DJ are all super skilled and great at their jobs. The food was delicious and almost all our guests complimented the catering. The location is fabulous and the service just takes it up a notch. We had an amazing experience and I would highly recommend this venue."],["Rashmi Agrawal","5.0","Mallu Farms was the perfect venue for our wedding! The lush greenery and elegant setting provided a breathtaking backdrop. The staff was attentive and ensured everything ran smoothly. Our guests were impressed, and it made our day even more special. A stunning choice"],["Riya Rajput","5.0","Mallu Farms provided the perfect setting with a spacious layout and beautifully landscaped surroundings. The venue offered plenty of customization options and accommodated the wedding setup flawlessly. The staff was cooperative and ensured everything ran smoothly on the day of the event. If you’re after a scenic venue that can handle both large and intimate gatherings, Mallu Farms is an ideal choice."],["priya baisoya","5.0","We recently hosted a family function at Mallu Farms and it was a resounding success! The venue itself is beautiful, with a lovely ambiance that made our gathering even more special. The staff was incredibly helpful and attentive to all our needs. But a big shoutout has to go to Heeba, the salesperson we booked with. She was fantastic! From the very beginning, Heeba was professional, patient, and ensured everything we discussed during booking was delivered flawlessly. Overall, Mallu Farms provided the perfect setting for our celebration, and we couldn't be happier."],["Jaskiran Kaur","4.0","It is a farm in Chattarpur. The venue was great with excellent service. Only the grass could have been a real."],["Riya Sabharwal","5.0","The venue, Mallu Farms, exceeded all our expectations and delivered impeccable service. The food they offered was undoubtedly the best, leaving our guests delighted with every dish. The entire experience was elevated by their great venue and top-notch service.\n\nFrom the moment we booked the venue, the staff at Mallu Farms made sure every detail was taken care of, ensuring that our event went smoothly and perfectly. Their attentiveness and dedication were truly commendable, making us feel like our special day was their top priority.\n\nIn fact, the service we received at Mallu Farms was exceptional and surpassed that of many renowned 5-star establishments. The level of professionalism and genuine care they exhibited made our wedding day even more memorable and enjoyable."],["Vaibhav Arora","5.0","We really liked the food and decor experience with Mallu farms team including Nitin, Abdullah and Priya Ma’am. We selected the menu with dim sums and sushi, and all food items quality and taste were top notch. Only improvement area is entertainment services as there was only one vendor for dj and they did not play songs requested by guests which would have lifted the party mood."],["Niharika Dang","4.0","There were initial hiccups but the end result was beautiful. Food and service was excellent on the wedding day almost everyone was raving about the desserts and snacks. It was well managed by the Mallu staff and Karan was overseeing everything himself. Suggestion: If you could add more teams on the decor panel so that initial coordination and selection of the decor team doesn’t become a task. Overall a wonderful experience. "]]},{"name":"Manish Malhotra","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1489009673_1439374404_manish_malhotra_files.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1489009673_1439374404_manish_malhotra_files.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406582_Model_in_Manish_Malhotras_ELEMENTS_Collection_LFW8_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406581_Model_in_Manish_Malhotras_ELEMENTS_Collection_LFW7_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406581_Model_in_Manish_Malhotras_ELEMENTS_Collection_LFW5_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406580_Model_in_Manish_Malhotras_ELEMENTS_Collection_LFW4_345x517__1_.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406580_Model_in_Manish_Malhotras_ELEMENTS_Collection_LFW3_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406579_Manish_Malhotra_Spring_Summer_2016_Haute_Couture_Collection_ELEMENTS_11_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406579_Manish_Malhotra_Spring_Summer_2016_Haute_Couture_Collection_ELEMENTS_5_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1459406578_Jacqueline_Fernandez_in_Manish_Malhotras_ELEMENTS_LFW_345x517.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1425536791_1425301705_manish_malhotra_lehenga.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/92\/1425533362_1425301705_manishmalhitracpaa.jpg"],"prices":"3,05,000-5,00,000","address":["Mehrauli, Delhi NCR","Ambawatta One, H 5\/1 Kalkadas Marg, Behind Qutub Minar, Mehrauli, New Delhi..."],"description":"Manish Malhotra is an Indian fashion designer who is known for his gorgeous cocktail gowns and lehengas with a modern twist. A bridal lehenga is the most important outfits of any girls life and what better than wearing a Manish Malhotra bridal lehenga for your special day. Manish Malhotra launched his label in 2005 and there has been no looking back ever since. There is not one Bollywood celebrity who has not been dressed up in a Manish Malhotra outfit, he makes outfits for every occasion. Apart from bridal wear, the label also designs a huge variety of groom wear.Buying a Manish Malhotra LehengaThe label has 2 stores in Mumbai and one store in New Delhi. Manish Malhotra outfits can also be found in the various partner retail stores across Delhi, Mumbai, Hyderabad and Dubai. In today's time of online shopping, people can buy anything just within a few clicks, the same goes for Manish Malhotra outfit. If visiting the store is not possible then one can also buy a Manish Malhotra dress from their online store and get it delivered to any part of the world. What is the cost of a Manish Malhotra lehenga?The price for light lehengas and gowns by Manish Malhotra start from INR 4 lakhs to 5 lakhs. The cost of bridal lehengas start from INR 5 lakhs and can go upto INR 13 lakhs or above. For more information don't forget to check out our blog on all that you need to know about the cost of a Manish Malhotra lehengaOutfit TypesThe label is known giving a modern twist to the traditional outfits and has a variety of bridal wear as well as groom wear outfits: LehengasSareesAnarkalisGownsDressesSherwanisJackets Kurta setsCan a Manish Malhotra outfit be customised?Unlike many other designers, Manish Malhotra does provide the option of customisation of lehengas and other wedding. Well that is not it, Manish Malhotra also provides services to design a bespoke outfit just for so that you can wear an outfit that was specially made for you to dress up on your wedding.Really like the skirt of the lehenga but not a big fan of the blouse? Well then you can easily mix and match pieces from the various outfits available and finalise your own wedding lehenga.Working StyleIt usually takes about 3 months for a wedding lehenga to be made on order, therefore it is advisable to finalise the lehenga for your wedding much in advance. If you are looking for a customised lehenga or a bespoke creation then it may take a little longer so make sure that you have sufficient time in hand. ","review":[["Vedika ","5.0","In a timeless red Lehenga, my vision of a modern Indian bride was fulfilled. I felt every bit of regality in that outfit. The veil added to the beauty of the entire ensemble. The style, fitting and finish was all class apart. So happy to be a MM Bride.Source"],["Arshia","5.0","My experience with the team was wonderful ! My engagement turned out to be exactly how I had imagined with such a perfect fit! Love their collection"],["TanyaNarang","5.0","I got my sangeet outfit customised, and he sketched the whole outfit for me.Source"],["Anonymous","5.0","The Manish Malhotra mumbai team was so easy to work with. They respected the fact that we are from the US and couldn't attend multiple trials so they perfected the outfit in one single trial. All measurements and such were given over WhatsApp. Love the Mumbai team!Source"],["Guneet ","5.0","I feel like anything I will say won't be enough at how beautiful his work is. The team at his flagship store are delightful. It was a surreal experience, trying on my lehngas the first time.\n\nSource"],["Shivangi Sharma","3.5","There was a lot of back and forth for sizing issues with Manish's team which created unnecessary stress. But the outfit was stunning and loved by everyone.Source"],["Rashmitha Vasa","5.0","Manish Malhotra was always a dream designer to work with for me- and I could not be happier with the end result. The team created a customized blouse to match the skirt, and added in a gorgeous cape to make it a truly unique outfit. Made me feel like an actual princess :) \nSource"],["Sabah Asnani","5.0","Good for reception dresses"],["Anushka Dhingra Saigal ","5.0","All the years of me imagining myself as a bride was full filled in that one outfit  "],["Mehak Sahney","5.0","Limited collection, but very open to customizing pieces. The only problem is the extremely elongated timelines and extreme use of can-can & net. For a new age bride who definitely seeks comfort and reusability, I would skip Manish."]]},{"name":"Movie'ing Moments","rating":"4.7","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/project\/60522\/1566461128_0__1_.JPG?crop=199,455,1619,910","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625485862_051A4002.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625485696__VIV9323.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625486539_DSC08907.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625485693__VIV9716.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625486647_MAN02641.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625485708_0S3A2041.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625486539_DSCF8672.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625486647_MAN03457.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625485861_051A3631.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625485710_17.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/11842\/1625486538_DSCF2801.jpg"],"prices":"175,000","address":["Andheri West, Mumbai",""],"description":"Movie'ing Moments is a team of young photographers and filmmakers who are passionately inclined towards storytelling in the most visually stunning way. The founder, Vaaibhav Singvi, and his passion for filmmaking, love for weddings, and joy in creating stories by freezing moments led to the establishment of this venture. This group of wedding photographers at Movie’ing Moments aim to capture the beautiful ceremonies, rituals and the culture in all its essence and rich, vibrant glory. Their insatiable desire in making marriages the most wonderful event ensure supremacy in their work across every aspect. After all, the clients are the celebrities in the movie of their life, and the directors at Movie’ing Moments do a damn good job at putting the story together!Movie’ing Moments is based out of Mumbai but they cover weddings all over. Several years of experience, the very best and latest technology, and an undying love for their craft is what makes them one of the best wedding photographers around. If visually stunning captures are what you are looking for, then look no further.From The Photography Team:“We at Movie’ing Moments, capture the essence of a wedding by redacting the moments through films and stills. We believe that every wedding has a story behind it and we record and release it. We present the story in the visually most beautiful way. With a belief that marriage is a sacred union of two loving souls and hence, we make sure to keep the essence of the ceremonies alive. Our films and stills reel out moments where the bride donning her pretty lehenga takes pheras with the dapper groom, where the cupid showers it’s love and jubilates the triumph of love, where the bridesmaids demand a handsome sum of money from their brother- in- law, where the in- laws gel up like old friends, where the friends of the bride and groom try desperately to document their own love story amidst the hullabaloo of the wedding. We love weddings and make you fall in love every time you unfold the wedding memories captured by Movie’ing Moments.”Services Offered by Movie’ing MomentsAn extensive range of services related to photography and videography are offered, such as:Wedding PhotographyCandid PhotographyTraditional PhotographyPre-Wedding ShootWedding Videos ...and so much more!Does Movie’ing Moments travel outstation for destination weddingsTheir team is happy to travel for destination and outstation weddings, too. Please note that in such cases, the costs involved with respect to travel and accommodation for the team are to be borne by the client. Latest Pricing and Portfolio of Movie’ing MomentsFor further details and queries regarding bookings and packages, kindly contact the team directly. On the WedMeGood portal, you will find the necessary contact information. Here, you will also find Movie’ing Moment’s impressive portfolio, photo albums, prices and their customer reviews.","review":[["Dhvani Zatakia","5.0","The most fabulous and professional team of photographers and videographers I have ever experienced. From the pre-wedding shoot in Paris, to the smaller home functions to the main wedding events in Goa - Vaibhav and his team have been an absolute dream to work with! All things said - they capture the best moments that stay on a lifetime..."],["Sakshi kalani","5.0","Dear Vaibhav,\n\nYou have been awesome to work with from the beginning! Thank you for sending the perfect team for covering our wedding & engagement. Each and every crew member did a fabulous job! Words are less to describe how comfortable we were with them. The team was super energetic, lent great ideas and direction, supportive and very co-operative. We look like movie stars :') The photographs have covered the essence of our union at the wedding and engagement ceremony beautifully and in such an authentic way. \n\nFinal edits are beautiful. We received all the deliverables timely. The team has super responsive.\n\nI would highly highly recommend Movie'ing Moments to everyone! Easily they are our favourite photographers now :)\n\nThank you for making our special day so memorable. We truly appreciate all the efforts. We are big fans of Movie’ing moments and highly recommend it to everyone looking to make their big day memorable!\n\nSakshi & Hardik"],["Pooja Devaraju","4.5","Very creative and accommodating throughout the process. Brought our vision to life through beautiful pictures and videos and visual storytelling. I'd recommend working with their team."],["Rahul Sreshta","1.0","Very unprofessional. I had got their referal from an acquaintance. But this company is only in the business of making money. They claim that they make memories but fail to mention that they are bad memories only.\n\nSpecifically, the photographer turned up an hour late for the sunset shoot. We got only 45 minutes of sunset time and weren't happy with the pictures that were given to us. The equipment was also quite substandard. The photographer failed to make us feel comfortable throughout the shoot. All in all it was a terrible experience. "],["Dr Aditi Jaiswal","5.0","I had my inhibitions about makeup but once she started working on me I was amazed. She gave me a different look for each event. The makeup was very subtle and beautiful. And the team was very humble and polite"],["Malvika","5.0","The second best decision we've ever made, the first was of course marrying each other! We couldn't have asked for a better team to capture the best days of our lives. The team was extremely accommodating and so friendly! They got in the spirit of all the functions and still managed to capture everyone's emotions so perfectly! As the bride and groom, we got too caught up with all the functions, but the team was always there to remind us to take some time out for pictures. They did a great job making us camera conscious people comfortable in front of the camera! We absolutely loved the videos and pictures, it captured the essence of our entire relationship! A heartfelt thank you from me and my husband, we wish you all the best for all future projects!"],["Alpa","4.5","The team at movie'ing moments is great. They have captured all the moments so perfectly. I am so much in love with the cinematography video that they have created, it makes me smile every time I see it. I have been married since 6 months now the the video looks so fresh and happy.  Thank you!"],["Dishant Batule","5.0","We had the best experience with Movie'ing Moments. Our most important day couldn't have been captured better than what the team has done. They were friendly during the entire events and have covered everything beautifully. \nI would recommend this company to anyone who wants to look back at their memories in the best captured photographs and films."],["Ankita Ray","1.0","The owner is very rude. As soon as you make the payment, they stop answering and reverting to client queries.\n\nThe photographs they sent for the wedding were sweet but they took the all the photos in horrible lights and mentioned the same the next day when we could no longer do anything about it.\n\nOn the owner- found him to be rude and not accommodating specially as far as client queries. \n\nYou always want to look back at your pictures and smile, unfortunately this one left a bad taste for me."],["Nikhil Khedekar","5.0","It was beautiful experience with Movie'ing Moments. The photographer was excellent. He perfectly knew his job. He was so proactive. He had all ideas in his mind, clear about how he wants to shoot. \nA note from my wife - When I met him on wedding day, I was into other stuff n could not give him time. He himself took efforts to get my wedding dress, accessories,clear the room  n start shooting without wasting time. I was completely blown away by his attitude and at that moment I felt so happy to choose Movie'ing Moments for my wedding shoot."]]},{"name":"Naman Verma Photography","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/vendor_cover_pic\/2984\/ad900715-494f-4778-9102-3900fbd0aa2a.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676741_DSC09131.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676743_pizzapasta_01.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676744_pizzapasta_07.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676742_10.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676741_DSC03222_copy_copys_2.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676743_NamanVerma_www.namanverma.com_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676739_NamanVerma_www.namanverma.com_2.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1546676743_vidhirush.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1499172239_NVP_6231_2.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1499172241_NVP_4983s_2.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/14248\/1499172240_NamanVerma_02_2.jpg"],"prices":"400,000","address":["Delhi NCR",""],"description":"Based in Delhi, Naman Verma Photography is a budding photographer who specializes in fine art and conceptual photography. They are a group of youthful and dynamic picture takers and cinematographers who are knowledgeable about each point of photography deceives and have all the most recent camera gadgets and bits of hardware. They, as wedding photographic artists, comprehend the meaning of an occasion called a wedding in your life and guarantee that your photos are stressed in your wedding collection. They are exceptional with present-day instruments of photography to deliver every one of their administrations. They have been shooting weddings for quite some time now, and they have delivered flawless services on many occasions with their expertise.Services offered by Naman Verma PhotographyNaman Verma Photography's various packages are customized to make sure that your dream wedding is under your budget. They are always ready to capture destination weddings for bridal couples. They cover a range of functions and are always up to cover all the ceremonial events. They offer many packages and services to customize as per your necessities and the budget range. Some of those services provided by them include the following:Wedding & engagementEngagement photographyMehndi & sangeetCouple pre-weddingTraditional photographyCandid photographyCinematographic photographyLive ScreeningIs Naman Verma Photography open for traveling to the venue?Naman Verma Photography's team is always ready to travel outstation to offer their services at your destination given that all the traveling and stay cost.Latest Pricing and Portfolio of Naman Verma PhotographyContact them to discuss your requirement and let them capture your delicate and lovely moments in a truly aesthetic way. Checkout their photos, albums, reviews and the prices offered by them before booking them for your wedding. Contact the vendor to learn more about their services and availability.","review":[["Apeksha","5.0","From the moment Mohit and I decided to get married and plan our wedding, Naman was the one person I knew I wanted to work with on our special day. As a fashion and beauty photographer myself, choosing the right photographer was the biggest bet of this wedding, and Naman exceeded every expectation. He was the first artist we booked, even before hiring our planners or finalizing a venue.\n\nNaman was an absolute dream to work with—gentle, calming, and incredibly professional. He made us feel completely at ease in front of the camera and gave such clear and thoughtful direction that we never felt unsure or awkward.\n\nNaman brought so much fun and energy, staying with us until the early hours of every event. He might also have been one of the best-dressed people I've ever seen working on location! His work truly speaks for itself—it was nothing short of stunning and magical. If we had the chance, we’d work with him a hundred times over!Source"],["Aakanksha Pawar","5.0","Naman is magic. Words fall short for his art. He has some power with the camera lens. He made all the pictures look so beautiful. It was truly a pleasure to work with him, and we are so glad that we chose him to get our forever memories\n\nSource"],["Sanya","5.0","Naman and his team were a dream team in every sense, they captured candid moments from the events and helped us ease into our couple shoots. Gandharv and I were extremely awkward about posing without looking like we were, so we really appreciated the guidance and patience from Naman and his team. Naman and his team flawlessly captured our friends and family in their natural element along with an emotional range of laughter and tears; every time we look at the pictures we feel like we are reliving what were the two most extraordinary days of our life!Source"],["tanya ","5.0","We used Naman Verma for our wedding Photos\/ videos and Apeksha Maker from House of Pixels for our portraits. The reason we picked Naman was because we didn’t want cliché wedding photos and wedding video. We wanted something aesthetic and authentic, someone who captured the real moments. Naman’s style of photography is mix between Editorial and commercial which is what we loved about him the most. His team really went out of their way to make sure they captured every single moment so we could relive this magical week over and over. And House of Pixels for being ever so patient and giving us portraits for a lifetime!Source"],["Anonymous","5.0","Naman and Dushyant are absolute mavericks of their craft. They make you feel comfortable and capture moments that no one else can notice. If your looking to have a lifetime of memories that send you back to your day, Naman is your guy! Source"],["Swati Utkarshini","5.0","Naman and his team are absolutely amazing at what they do, they are creative geniuses who aren't afraid to push the boundaries in wedding photography whilst making you feel completely relaxed. We've been completely blown away by our wedding teaser and photos and couldn't recommend them enough.Source"],["Aasheekaa","5.0","Naman Verma was our photographer and we were so lucky to have Naman and team capture our wedding. His work truly speaks volumes. We wanted someone to capture moments, not posey pictures and Naman has done that just brilliantly. In addition, he is super humble and chill and easy to work with.Source"],["Priyanka H","5.0","He is extraordinarily brilliant in his work. Very cooperative and hardworking. would recommend to all the brides.Source"],["Aradhana","3.0","We chose him to do the photography for all of our wedding functions and personally I'm a little disappointed with his work. He is more of a portrait person and doesn't focus on everyone. We had a huge gathering of 1000 people and he wasn't able to cover them nicely. The delivery was on time and he was under our budget but yet I'm disappointed cause this was his only job and he didn't do justice to his work."],["Ashna Reddy","5.0","Choosing to work with Naman and his team was one of the best decisions we made for our wedding. Our photos and video ended up being unbelievably beautiful and did such an excellent job capturing the vibe at each of our events. I’d recommend him to anyone in a heartbeat."]]},{"name":"Nitin Arora Photography","rating":"4.8","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556886_NAP_8634.jpg?crop=8,130,948,533","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556904_Wedd_190.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556904_Wedd_173.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556884_Ringcer_37.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556905_Wedd_801.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556885_Ringcer_481.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556882_PAW_9755_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556725_0S0A5621.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556882_NAP_5753.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556775_125A1512.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556885_MJ061488.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/126299\/1648556905_Wedd_324.jpg"],"prices":"On Request","address":["Gurgaon, Gurgaon",""],"description":"Nitin Arora photography is a Delhi based wedding photographer offering bespoke services. They are a team of well trained and passionate photographers and videographers who work to deliver you the best of your expectations in the most creative way possible. Photographs for them is not just about posing or giving fake smiles, it is much more about the trueness of the moments. The images tell stories and ideas of people who are full of beauty and life. They work to capture the most important and happy moments of your life in a way that the pictures will make you smile for years to come. Just a glance at them will take you back to the moment itself.Pictures are a way of reliving the moments which are otherwise gone. Long after those special days, when you wish to go down the memory lane and feel it all again, you realise the importance of the photographs. Nitin Arora, the man behind this Delhi based, well renowned photography venture is a professional photographer who creates artistic, fashion and lifestyle images with a unique style. These are often identified with vivid colour and expression. So for all you camera obsessed families, wanting to create a memorabilia of your events, contact them!Services offered by Nitin Arora PhotographyNitin Arora is a professional wedding photographer that offers a wide range of services that can be easily customized according to your needs and preferences. Whether it is your mehendi, sangeet or your reception, Nitin Arora and his team know exactly what to do to capture the essence of each function with complete clarity and detail. They provide end to end services, from providing edited and processed photographs to designing a unique photo album, with Nitin Arora Photography you will not have to worry about anything.The wide array of their services include:Wedding VideographySave the Date VideosWedding FilmsTeaser VideosStill PhotographyPre-wedding shootsOpen to Destination Weddings \/ Weddings in other citiesYes, As done in past, they happily travel to your desired destinations to cover your special days.","review":[["Hitakshi Wadhwa","5.0","Nitin and his team felt like family, yet they were highly professional. They didn't miss a beat in capturing all the moments we'll want to remember from our wedding. Their creativity and spontaneity made our photos and videos truly special, turning ordinary moments into unforgettable memories. They paid attention to every detail and adapted to every situation, ensuring nothing was overlooked. \nThe refreshing choice of songs in our wedding video perfectly matched our vibe as a couple and evoked our emotions we experienced in the celebrations adding an extra touch of magic to our memories. \nWe're thankful for their talent and dedication, as they've given us a beautiful collection of memories to cherish forever."],["Sahiba Chona","5.0","We recently booked Nitin Arora photography for my sister’s wedding. And I am Awed but the exceptional service provided for my sister's wedding, capturing the day with an artistry and professionalism that far surpassed our expectations. From the initial consultation, it was clear that Nitin Arora and his team were dedicated to understanding our vision and ensuring every moment was beautifully documented.\n\nI would highly recommend Nitin Arora Photography to anyone looking for a wedding photographer. Their work goes beyond merely taking pictures; they create art that immortalizes the beauty and emotion of your special day. I and my whole family are deeply grateful for the extraordinary memories Nitin Arora and his team have provided us."],["Hamza Hasan","5.0","Shanaya and Nitin, the best team you can ever ask for !!!! They have created an incredible wedding film and the most beautifully captured picture album for us. They captured the essence of our special day in a way that exceeded our wildest expectations. Every frame is a cherished memory that we will treasure forever.\n\nA big thank you to the entire team for being so patient with us the entire time. They all made us feel comfortable and at ease throughout the entire process.\n\nWe are beyond grateful for the beautiful moments NAP has preserved for us.\n\nTHANKYOUU, YOU GUYS ARE THE BEST !!!"],["tanushree kakani","5.0","The team was super fun and friendly! They understood me and Nick well and made us feel very comfortable. I now use their tips and tricks before getting any photos clicked. All the photos and videos were just outstanding and even better than I had expected. I was blown away by the details, and the beauty of it all. Perfectly captured the most important moment of our lives!Source"],["Satvik Kulshrestha","5.0","Our words won't do justice to what our experience with Nitin and Shanaya has been. For us it was extremely extremely important that our wedding is captured in a certain way and it had to be perfect for us, we struggled for almost 3 months before we stumbled upon Nitin's profile on instagram and we still thank our stars that we went ahead and chose them. Out of all the photographers out there we connected with them instantly and you feel their warmth in the first interaction itself. Well cut to the wedding - all we can say is that the entire team makes it so easy for you and they capture your most important day just beautifully - they are extremely extremely professional, their work speak for itself. We are so proud that this is one thing we got right and the best part is they make it extremely easy for you to work with them and this helps them to get the best out of you. I can blindly recommend them to anyone looking to capture your wedding day! Just go with them and realize how good these two are with their work and more importantly what wonderful people they are. And not to forget the post wedding formalities right from song selection (special shoutout to Shanaya for her music taste ♥️), editing, timely deliveries of all deliverables you name it and they deliver it! To summarize the entire process was extremely smooth and flawless - if you go with them you don't have have to worry about this department because you are in good hands! "],["priya harlalka","5.0","Choosing Nitin Arora Photography as our wedding photographer was one of the best decisions we made. Nitin, Shanaya and the entire team were so friendly and made us feel so comfortable throughout the process. They are so dedicated and put in all the efforts to capture every big and small moments in the most beautiful way. Their attention to detail and creative approach resulted in a collection of photos that we will cherish for lifetime.\nI highly recommend to choose Nitin Arora Photography to capture your special day as they will go above and beyond to deliver remarkable memories. "],["Ankita","5.0","Nitin & Shanaya - I always run out of words to express how amazing these 2 are. I met nitin & Shanaya a day prior to our functions and it was an instant connect with them.. the amount of effort they put in - is unbelievable. They connect with each and every family member and make sure everyone feels important - which i feel is very important. I had a really strange request - the groom hates getting pics clicked so i had told them not to go around Dhruv at all and only focus on candid and they did the most amazing job - we had no interviews, no couple shots and hardly any family pics but if you see our wedding pics and videos - it doesn't look like anything is missing. The entire team was so enthusiastic about each and everything. From fab asthetics to ideas to the delivery - it was the best best experience. Best part about this experience - youll end up with 2 amazing friends and lots of content ( if you're obsessed with pics as much as I am)\n\nSource"],["Shambhavi Chauhan","5.0","They are the best in buisness. Epitome of talent and class . \n\nThey will put their heart and soul in every picture and video of yours and they are so easy and effortless to work with. Aapke saare bollywood ke sapne inse poore hojaayenhe haha, they ll capture you in your most natural self so beautifully. They made my wedding so so memorable that now I look for occassions to get them onboard again , haha . Handsdown truly the best!!! ALL HEARTS"],["Mariya Darakshan","5.0","I cannot express how grateful my partner and I are for choosing Nitin Arora Photography to capture our special day. From the beginning, they showed a remarkable understanding of our requirements and delivered an exceptional experience.\n\nNitin Arora Photography truly excelled in making us feel comfortable throughout the entire process. Their presence on our wedding day was unobtrusive, allowing us to fully immerse ourselves in the moment while knowing that every precious memory was being captured. It was refreshing to work with a team that understood the importance of being present without being overly invasive.\n\nWhen we received the wedding pictures and videos, we were simply blown away. The quality and attention to detail surpassed our expectations by a mile. The emotions, the joy, and the love were all perfectly encapsulated in each shot. Nitin Arora Photography's talent and dedication shone through in every image, and we are eternally grateful for the beautiful memories they have given us.\n\nWe cannot emphasize enough how much we appreciate Nitin Arora Photography for going above and beyond. Their professionalism, creativity, and ability to understand our vision resulted in a collection of stunning photographs and videos that will be cherished for a lifetime. If you are searching for a photographer who truly cares about capturing the essence of your special day, we wholeheartedly recommend Nitin Arora Photography. They have given us a gift that we will treasure forever."],["TanushreeKakani","5.0","Weddings are some of the most unforgettable memories in one’s life, and capturing these memories in the most beautiful, unimaginable way are Nitin and Shanaya. I was very particular about several things regarding my wedding and when my cousin introduced me to Nitin Arora Photography amongst several others, I was convinced that they were the right fit. And oh my, was I surprised - in the best way possible!\n\nThe attention to detail, the creative eye, the editing, the cinematography - you name it and they nailed it. I was lucky to have both Nitin and Shanaya cover my wedding along with their brilliant entourage who were friendly, made us feel very comfortable and made the whole process fun no matter how tiring it got. \n\nThey went above and beyond when it came to getting the perfect clicks. They captured each and every moment across the days in a way that brings me tears and joy every time I relive it through the photos. It was all very aesthetically pleasing. \n\nWhen it came to the reels, teaser and the wedding film - I had no words the first time I watched it. I felt like I was taken back in time and relived my wedding all over again. I can’t see how they could have done anything else to change anything in the videos - it is all just perfect. They kept in mind my likes and dislikes and put together everything in a way that not just me, every single person loved watching the videos! \n\nI highly recommend Nitin, Shanaya and their team’s creative lens to capture your special moment as they put in all their effort and leave you with the perfect results and memories to cherish for a lifetime. Thank you for capturing them in THE perfect way! And a special thank you to Shanaya for taking all my requests with always a smiling, cute “Haan ji”. "]]},{"name":"Ombre by Harsheen Jammu","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/vendor_cover_pic\/1778\/b4d12bc4-a166-4bf5-8f4a-45e591211beb.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051401_Ombrebyhj_VS_49_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051398_Ombrebyhj_CP_04852__1__copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051399_PK_AA_11.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051399_DSCF9507_Edit_Edit_Exposure_copy_3.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051401_Ombrebyhj_JD_3112_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051400_OmbrebyHJWS.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051399_Ombrebyhj_KN_15022019__4_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051399_OmbrebyHJ_PT_2256_copy.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594051399_OmbrebyHJ_PT_2323.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594049641_OmbrebyHJ_PT_27feb_3620_Exposure__1_.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/9989\/1594049640_OmbrebyHJ_9578.jpg"],"prices":"300,000","address":["Sohna Road, Gurgaon",""],"description":"Photographs are the most tangible item you walk away with. Therefore, it is imperative to hire the best photographer for your tastes. We at Wed Me Good got you covered with the best in the country! Ombre by Harsheen Jammu is a professional photography service based in Delhi,NCR. Having an experience of over 7 years in the industry, Ombre strives to create a story out of the moments for you so real that you can live every special moment of your wedding time and time again.About the VendorHaving been featured by Vogue, The Hindustan Times, Mathrubhumi, Fearless, Deccan Chronicle and many more, Ombre by Harsheen Jammu is a photography team to look out for! Ombre, the team works tirelessly to perfect the wedding cinematography craft and deliver narrative films to their customers.They have created loads of wedding films all over the country , each with a unique narrative that represents the style and personality of every couple.Through their photography and cinematography, they aim to capture the real action and emotion of the wedding.By the Photography team“We believe in classic beauty,window light ,original ideas. Working with every bit of the creativity we've been given,and never missing an opportunity to revel in the absolute wonder of what we do . We believe in lazy mornings, short breaks, long kisses, and moments that feel like they go on forever. We believe in memories and moments and all the tiny unforgettable things that happen in between . We dance too long , smile too much , and have more than a few great stories to tell . Our clients like us because we know what exactly they are going through , but trust us because we know how trust is earned , And we work like hell to earn it .Most of all ,we honestly ,furiously love what we do !!!!”Services offeredOmbre by Harsheen Jammu provides services for a various occasions like: Traditional PhotographyCandid PhotographyCinematographyPre-Wedding ShootAlbumsWorking styleOmbre by Harsheen Jammu’s team  loves to travel. They are very location agnostic when it comes to capturing a wedding. From mountains to coasts , urban to country side,they have travelled miles to capture the diverse stories their clients have to offer. So let them capture all the best bits, the love, the laughter, tears and cheers! So you can loose yourself in the fun. Relive it all again  later with photos that are ‘so you’ , and not ‘so everyone’.","review":[["Sruthi Selvaraj","5.0","The team did amazing work! The pictures turned out to be surreal Source"],["Saanya","5.0","Ombre Photography captured the essence of our wedding day beautifully. Their talented team expertly documented every moment, from the heartfelt exchanges to the joyous celebrations, with creativity and precision. The photos exceeded our expectations and will be cherished for a lifetime. Working with Ombre was an absolute pleasure, and we're grateful for their professionalism and passion for their craft. Thank you for giving us such stunning memories to treasure forever!Source"],["Payal Singla","5.0","Harsheen, Pulkit and team were a delight to work with. They covered all out wedding events and a photo shoot at our college (where we met and fell in love ❤️) . We will cherish these memories forever!"],["nikita oswal kothari","5.0","Harsheen and her team are just amazing people who work so hard to give you the best you can ever imagine, they were so easy going and yet on point with their shots that not just us but even our families loved them. I definitely see Harsheen as my extended family now and I cannot wait to have another occasion of getting clicked by them. Absolute favourites and love them."],["khoooshbu","5.0","We had hired them for our wedding, they were extraordinarily good! We love their work, they are really sweet people and fun to work with!"],["Saumya Gupta","5.0","Pulkit from the team did a fabulous work. Their work is really good. A very professional team, and are good at what they do.Source"],["Daedeepya Yendluri","5.0","Ombre was handling photography and videography whereas we asked Varun to click some additional photographs. Both did such a wonderful job. Photography was something that I was most apprehensive about. Both Vishnu and I are a little camera shy and having a good team who can work with that was very important to us. Harsheen and Varun worked well together. I cannot say enough about Harsheen and her team, the pictures came out so so amazing. I couldnt have asked for more. She was very patient in trying to get us to pose. I really like her quirky aesthetic.Source"],["SaketUpadhyay","5.0","Ombré is just Love 🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻 Every picture of Ombré speaks out loud in itself ♥️"],["Saima Gupta","5.0","The entire team is super fun and professional at the same time. They're the best at capturing beautiful candid moments. They did an amazing job at shooting editorial, candid and traditional photos and an even better job and curating the entire wedding video."],["Somi jain","5.0","Ombre team was super nice and made us feel so comfortable. They beautifully captured our special moments. I can not thiank them enough for all the precious moments they captured for us and the creative poses they told us!! Amazing work everything truned out so beautiful and perfect!! Thank you Harsheen."]]},{"name":"Play The Novel","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1737634271_WhatsApp_Image_2025_01_23_at_5.40.11_PM.jpeg?crop=3,613,1058,595","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1696573884_Screenshot_115.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1696573883_Screenshot_107.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1737633915_Snapinsta.app_432696690_777632457755087_7295425743464690573_n_1024.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1736316071_image149.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1736315761_image486.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1736315509_image2732.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1696573883_Screenshot_105.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1736316088_image7558.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1736315805_image8153.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1736315499_image4414.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3469431\/1696573885_Screenshot_119.jpg"],"prices":"400,000","address":["Byculla, Mumbai",""],"description":"Play The Novel is a professional wedding photography and cinematography company situated in Bycualla, Mumbai. They have been documenting some of the most beautiful wedding celebrations as well as other events since 2021 and have already impressed numerous couples with their unparalleled skills and photographic expertise. From the intimate moments shared between the couples and their family to other precious moments of the wedding celebrations, they capture every little detail with utmost precision and dedication. So if that’s what you are looking for for your wedding photography and videography, then they can be someone you can consider booking. Services Provided By Play The NovelIn order to cater to the diverse requirements of their clients, they offer them a wide range of services and options to choose from, ranging anywhere from candid photography to pre-wedding shoots. These services can also be easily customizable as per your needs and preferences. Here are some of the services that they provide:Candid PhotographyTraditional PhotographyTraditional VideographyWedding FilmsPre-wedding ShootsPre-wedding FilmsAlbumsWorking Style Of Play The NovelTheir working style is often described by their clients as being fun, vibrant, and natural. They make sure that everyone around them can feel comfortable and can truly enjoy the celebrations without feeling conscious of the camera. Furthermore, they capture each moment with utmost professionalism and make sure to deliver the pictures and videos on time. Cities Where Play The Novel Have Shot WeddingsSo far, they have shot weddings for many happy and satisfied clients across cities like Mumbai and Pune. But other than that, they are also willing to travel to your preferred location to provide their wedding photography and videography services and also cater to their outstation clients. Location Of Play The NovelThey are based out of Byculla, Mumbai. ","review":[["Ruhi","5.0","Play The Novel didn't just capture our wedding, they captured the depth of every emotion in the most beautiful and meaningful way possible. Their creative vision, attention to detail, and ability to convey raw emotions are simply extraordinary. If you’re looking for a team that’s not only exceptionally talented but also genuinely passionate about telling your unique story, PTN is everything you could wish for and more."],["Tasneem G. S. ","5.0"," Words can hardly express how we felt about the work PlaytheNovel’s team did capturing our wedding and story. From the moment we met Raveena and Khozema, we knew they understood not just the aesthetic of our love story but the heart of it. They didn’t just take pictures, they told a beautiful narrative of us and our journey. The whole team, from our prewedding to the wedding, was patient and attentive with us and cheered us both whenever we needed to pose or then had a special moment that they were going to capture. The team captured us and our story in the most genuine light. We truly felt that Raveena and Khozy honored our love, not only in how the wedding captured it visually but also in how respected and celebrated the unique elements of our relationship. Thank you for being such a big part of our day. The images and wedding videos, as promised, are being seen regularly, which reflects what a great job the team has done! \n\nLook forward to working with the team again in the future, who knows a 25th anniversary celebration, perhaps :P "],["SHIMONI AJAY","5.0","They are a dream team! Not only helped us in capturing memories of life but they thoroughly supported us in the process of planning. Their team were super professional and made us feel like an absolute star! You cannot go wrong with play the novel, one of the best decisions. "],["Neha Daryani","5.0","The magic they see is truly the magic they create! From start to finish, Play the Novel went above and beyond to capture every moment of our wedding with such creativity and attention to detail. They didn’t just film an event—they told a story, bringing every laugh, tear, and celebration to life in a way that felt so authentic to us. Watching the final video brought back all the emotions of the day, and we’ll treasure it forever. Thank you for your incredible work, especially the heart and soul of the team; Raveena and Khozy! "],["ankita mishra","5.0","Choosing Play the Novel to capture our wedding was one of the best decisions we made. Led by the talented Khozema Udaipurwala (Khozy) and Raveena Doshi, their team brought unmatched artistry and storytelling to every moment. They took the time to understand our journey, capturing candid laughter and heartfelt exchanges with precision and authenticity. From the grandeur of Jaibagh Palace to intimate moments with loved ones, every shot felt timeless and cinematic. Their storytelling style turned our love story into a masterpiece, making each frame a scene from a novel. Play the Novel is more than a photography team—they are true memory-makers, and we couldn’t recommend them more!Source"],["Madhura Veer","5.0","For videos we wanted someone who shares similar sense of cinematic aesthetic as well as love for bollywood because our wedding was surely going to have those filmy dance moves. We met with Raveena and Khozema from Play The Novel and they was an instant connection. We knew that we were going to make the best team. They surely went above and beyond and blew our mind with such beautiful wedding film. They really connect with couple, understand their story and make everything extra special and unique. It was one of the best decisions to have them shoot our wedding. "],["Aashray Shah","5.0","Khozema and Raveena were absolutely amazing to work with! They delivered everything even before the promised dates, and the quality was exactly what we had hoped for.\n\nFrom the beautiful photos to the incredible videos and the most unique novel- style album they created, everything was just perfect. We couldn’t have asked for a better team to capture our special day. "],["Karan Shah","5.0","When we dreamt about how are wedding look , Khozy and team clicked them and brought it to reality . Thats how good they are !"],["Swati Yadav","4.5","We couldn't be happier with our wedding photos! Our photographer was incredibly professional and made us feel at ease throughout the day. They captured every special moment beautifully, from candid shots to stunning portraits. The attention to detail and creativity really shone through in every image. We now have a collection of memories that we'll cherish forever. Highly recommend!"],["Sumit Kalra","5.0","A completely different league of wedding photography is something I encountered when I came across Khozema and Raveena's team. \n\nAn exquisite and the most splendid blend of crafting our love story full of peaking emotions is what PTN pulled off. \n\nTrue artisans skilled with extreme level of craftsmanship when it comes to making wedding love stories. \n\nBig thanks to the complete PTN team for spreading this everlasting joy in our lives."]]},{"name":"Rambagh Palace - Jaipur","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1489016829_1461913091_Rambagh.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1489016829_1461913091_Rambagh.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1446278858_taj_rambagh_palacejaipur_hotel_001p.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1446278858_Rambagh_Palace_Jaipur.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1446278858_rambagh.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1446278857_jaipur_wedding_3.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1446278857_getimage.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/23627\/1446278857_002931_02_hotel_courtyard_fountain.jpg"],"prices":"On Request","address":["Lal Kothi, Jaipur","Bhawani Singh Road, Jaipur, Rajasthan 302005"],"description":"Located in Jaipur, Rambagh Palace hosts many signature experiences which makes it perfect for a wedding or any gathering. Originally built in 1835, the palace has rich textured rooms and opulent furnishings, which makes it perfect for wedding guests to retire. The gardens are arranged in brilliant symmetry. On arrival, guests are welcomed by decorated camels and Rajasthan ladies which perform tikka ceremonies. Space availableWhen it comes to wedding celebrations, they has a Hall which is ideal for cocktail parties and pre-wedding ceremonies and a lawn for hosting wedding ceremony. It is a beautiful venue that adds grandeur to all your events.Hall The indoor banquet hall has the capacity to host 500 people at the same time and is just the perfect venue to host pre wedding ceremonies such as mehendi, haldi ceremony or an engagement party.Lawn The lush and green outdoor lawn is a great option to host grand wedding ceremony or a reception party that has a guest list of about 1000 people.Rooms There are 45 rooms and 33 suites with stunning views Facilities Available in Rambagh PalaceAs per the decor policy, the decorators for any event must be selected from the enlisted panel. Be it a simple and classy décor or an extravagant one, their in-house décor teams can do it all with utmost perfection. They do not allow any other decor vendor from other than those mentioned in their panel.CuisinesThey have in house catering policy. With an extensive catering option, they have a multi-cuisine menu and serve a variety of vegetarian and non vegetarian delicacies. They do not allow any catering vendors from outside for any events in the property. They provide inhouse alcohol and alcohol from outside is not allowed.LocationLocated in Jaipur on the Bhawani Singh Road, Rambagh Palace is a great wedding venue for your special day. The guests can visit Amber Fort, or float blissfully in a hot air balloon or explore local block printing art.It is one of the perfect venues to host all kinds of ceremonies or celebrations. They will ensure to make your celebration, eventful and worth remembering a lifetime. You can check for availability and prices directly from WedMeGood.","review":[["Pankaj","5.0","The services were fab staff was really professional,food was mouthwatering and the flower decor was just awesome.Had an amazing experience."],["Rupal ","5.0","For me, tying the knot here was a dream come true, as hailing from Jaipur, Rambagh Palace with its royal history and grandeur represents the fairytale wedding every bride wishes for. Source"],["Pankaj","5.0","We had a really great experience here,the services were amazing,the decor was just fab and the food was mouthwatering.Would highly recommend."],["Madhavan","5.0","The ideal location for destination weddings and other wedding related events.We had a great experience."],["priya Sethi","5.0","Both of us always wanted a palace themed wedding and what better place than Jaipur. We had our Mehendi and wedding at Taj Jai Mahal Palace and Engagement at Taj Rambagh Palace, just how we dreamt of. Both the venues\/ ambience are perfect for anyone is looking for a royal vibe. The staff were professional and helpful. Outstanding food menu from local to western cuisines. Unobtrusive services have always been a part of all Taj properties and we weren’t disappointed at all. We had a very smooth dealing with their sales department. They were very cooperative even with the smallest requirements of the guest. Would highly recommend both the properties. Thumbs up!\n\nSource"],["Anisha Bafna","5.0","One of the best wedding venues in Jaipur! If you want your wedding to be a Royal Affair, without any second thoughts, just reserve this venue for yourself. We chose Rambagh Palace for my Cocktail party and my main wedding day function and couldn't have been happier."],["Juhi Lohiya","5.0","My wedding was at Rambagh Palace. And my experience at the venue was lovely. Their services were great and I adore their warm hospitality. All our guests were very happy with all the arrangements."],["Priyanka Sharma","4.5","Its a dream come true place...everything at the palace is so dammm delightful and royal...love the place ambience food hospitality everything."],["Harshita Jain","5.0","I like everything, from the royal reception to the upgrade to Historical suit, friendly staff, in 2 days we felt the palace like home, our experience were beyond expectation. The gardens, the corridors of the palace, peacocks every where, words cant describe our experience. Overall our stay at this hotel for marriage was probably the best i could describe. This beautiful property was rich in history and well maintained. We especially enjoyed the evening music and dance performances and how the sight of the palace ended with a historian who shared his knowledge about the region with us. The hotel was so spacious and comfortable that we almost didn't want to leave it to go out into the hustle and bustle of the city. This beautiful palace is simply perfect for royal weddings."],["Ramzil","5.0","We were absolutely delighted with our stay at this gorgeous palace hotel. Besides our beautiful and impeccably maintained room, the amazing grounds, and the beautiful restaurants the most amazing thing was the very warm and personal service from the reception to the dining room.Chef Sameer Shah's cuisine was outstanding. The reception on the main lawns with the backdrop of the hotel has left an indelible impression on our minds. The staff delivered impeccable service."]]},{"name":"Recall Pictures Photography","rating":"4.1","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/vendor_cover_pic\/15302\/077cb8d5-de91-4b55-b894-98dea15891c8.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_70451550_3002958939929562_3130279405905678674_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_67752201_166227384429334_2345606677548601001_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_67561458_378816372836612_1238856343906428107_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_67426806_1506387119503695_289987873880144501_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_67402388_701787240294205_4552829574129637695_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_67389823_140093253876921_1432419684791406248_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099292_66323417_405509226746822_7702435183759179844_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099269_65227883_851182345263262_3256725177470017179_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099269_65153442_461523404583089_1677984959492363162_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099269_64878747_364382741100313_4836099597106209631_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/78888\/1568099268_64778250_149131269582856_5423433559262293434_n.jpg"],"prices":"115,000","address":["Mumbai",""],"description":"Recall Pictures is a creative film and photo production collective based in Mumbai. Working with a network of diverse professionals for 8 years, they believe in the importance of strong visual communication. They have great techniques and latest technologies to capture the best phase of your lives with the utmost professionalism and have won various awards for the same passion. They capture the stunning moments of your nuptials and convert them into an album which you can cherish for a lifetime. Their team is ready to travel outstations for your convenience. Recall Pictures has a basic motto, “Celebrate life and its connections.”Services offeredWedding photography and videographyCandid photographyPre-wedding shootsTraditional photography and videographyCinematographyAlbums","review":[["Peregrine Foods","0.5","RECALL IS A SCAM ARTIST.\nRaonak is the greatest scam artist of all time. We had hired him for our engagement in Dec 2022. Everything went smooth and he had asked for his complete payment after the event was done. We asked him to take it once the photos and videos have been sent but he said he cannot do that as full advance is the industry norm.\n\nWe trusted him and gave him the payment and after that he just vanished. The photos of the event was luckily given to us by a friend of his who he had hired for the event. The video and other pictures taken by Raonak have not come yet. He has stopped replying to message or calls. \n\nHe is the WORST SCAM ARTIST. We are in the process of lodging an FIR against him as well. Please we warned and DO NOT HIRE HIM\nAlso his company has shut down and he doesn’t pay GST but takes that money. And he has no employees left as he has not paid them. \n\nCall me or comment if you want any further proof."],["Sheshank Kumar","0.5","BE VERY CAREFUL!!!!\n\nSummary: Choose someone else. DO NOT HIRE RECALL IMAGES IF YOU WANT TO RECALL ANYTHING. His company is shut down. \n\nDetails:\n\nWe hired Rounak for our engagement ceremony on the Dec 2022. He seemed like a good and friendly person at first. He asked for advance and then the full payment post the event. He told us it was the industry norm so we obliged and handed him the entire amount.\n\nPost this he took weeks to give us the photographs of the event. These came out well but he missed out a lot of people at the event and the number of photographs were a lot less than expected. But the quality was good. What we had realized is that he had gotten his friend along with him and he was the photographer. He was from Rikaar images, and we realized that he was the person responsible for the beautiful images in the first place. The person from Rikaar saved the event with his beautiful pictures. \n\nWe had paid Rounak (Recall Images) the full amount for even a video. He kept delaying for weeks stating one excuse or another. After 2 months he stopped replying all together. No reply to messages or to calls. He just ran away with the money. We even asked Rikaar to help us locate him but he told us Rounak was not picking up even his phone calls.\n\nWe then did more research (which we should have done before) and realized that he had done the same with others as well. And his employees were not paid. His IG is not updated and his company is more or less shut down. \n\nMy sincerest request to all of you. DO NOT HIRE RECALL. You can explore Rikaar or any other photographer. But DO NOT take recall if you want to avoid a nightmare.\n\nMessage me for proof or any other explanations. "],["Ria Bajaj","5.0","We are pretty happy with our pictures from Recall, looking forward to seeing how the wedding video turns out.Source"],["Richa Fotedar","5.0","Recall Pictures - I fell in love with Raonak's creativity and edits from my friends wedding! I knew i wanted them for my wedding instantly!Source"],["Aditi","5.0","We decided to go ahead with Recall Pictures for our special day, as we had heard great reviews from friends and sure as hell, they did not disappoint!! Roanak and his team more than lived up to their reputation. We were really happy with quality of work wherein the team managed to capture all our special and candid moments during the ceremony, as well as family portraits that will be remembered for years to come. Lastly, given COVID, we were especially happy with the level of care and precaution taken by the team – they were careful to maintain a safe distance at all time and had donned face mask, face shields and gloves! I would highly recommend the team at Recall Pictures. Source"],["Mayuri","5.0","Recall Pictures did our photos and videos. They were a lot of fun to work with, and delivered everything in a timely and professional manner. We built a wonderful relationship with their team, and they made us feel very comfortable.Source"],["Tanya ","5.0","Raounak and his team really went out of their way to make sure they captured every single moment so we could relive this magical evening over and over. They were always around, not missing a single thing from before the events started until the end of each night. And House of pixels for being ever so patient and giving us portraits for a lifetime at our engagement party.Source"],["Khushboo","5.0","The more I say it's less. The team dont just run a business, they are so much more. They run this with their heart and soul. All they ever expected out of us was be yourself. Nothing more or less. The video, the pictures everything is captured for us like magic. The entire team ensured that we are extremely comfortable. We cannot thank them enough for the work that they have done. When you look back to it today, it's just happy memories captured on screen."],["Shraddha Vora","5.0","I got in touch with the team to shoot a friends wedding, must say we were pretty impressed with the pictures & the cinematography. They have a perfect view to click the perfect pictures thus creating memories.\nKudos to the team for putting up such beautiful memories together."],["Silky ","5.0","Recall Pictures, my photographer and videographer makes on screen mystic. I was stunned while watching my wedding video and in awe of how every single emotion was captured. I fail to understand how it is always possible for them to record every special and emotional moment that not just me but each of my family members felt at the time, it is almost like the cameraman was present everywhere at once. I am thankful to the entire team for making sure no stone was left unturned in giving me the best memories that I can now cherish for life. Source"]]},{"name":"Reelsandframes","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1504083397_3.jpg?crop=244,126,1618,910","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093439_10.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093436_6_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_1_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093439_40.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_1_2.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093439_0.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_33_0.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_4.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_25.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_33_2.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/113\/1619093438_24.jpg"],"prices":"400,000","address":["Colaba, Mumbai",""],"description":"Reels and Frames is an award winning wedding photography and film company with prestigious clientele including the likes of McDonalds India, Rosy Blue Diamonds, Nilkamal, Samsonite, Loreal, Tech Mahindra, Kalpataru, TBZ and Dunlop to name a few. We've been featured on television and in over 50 newspapers and magazines worldwide (including Harper's Bazaar, Mid Day, The Hindu, DNA, Economic Times and many others). We have shot in five continents and over 14 countries. Our team consists of top notch visual artists who are united by our common love for shooting people in love, travel and of course ... wedding food !","review":[["Vedika ","5.0","A team of efficient freelancers who come together to create sheer magic. Prompt and very attentive to the needs of the planners and the couple. Worked in sync to create timeless shots, can't wait to see the trailer and film.Source"],["Tanushka Anand","5.0","The whole team just became a part of our crazy punjabi family. We absolutely loved shooting with them as much as they loved capturing our favourite moments. Before our wedding my only brief to the team was that I want everything very much candid and natural. And that is exactly what they delivered, they captured the very essence of my wedding. The whole team is very talented and they are truly the best in business. Choosing them as our photographers for our special day was the best decision we made.\n\nSource"],["ManognaLekkalapudi","5.0","Highly recommend Reels and Frames. I love their style of fun, fresh, and colorful photography. The team that came to our wedding was so friendly, cooperative, and excited to be a part of our day. We completely trusted them with our photography and they delivered big time. We have some memorable pictures thanks to them!\n\nSource"],["Anonymous","5.0","Anand and his team were outstanding. Both Aditya and I are not very camera people, but this team has made the entire wedding shoots so easy for us. They were so hands-on and had the true sense of the perfect place and time. They shoot a last day edit for us, and made us relive every emotion and day.Source"],["Anonymous","5.0","I am so glad I got them for my big day. They are so easy, patient and extremely talented. Involvement with the family and just all round perfection made me certain there could be nobody else who’d do justice.Source"],["Anwesa Barpanda","5.0","Such beautiful pictures and talented team.You are one the most professional, creative and very entertaining photographers. Quality content supported with amazing photography by this talented team."],["Tejasvi","5.0","Anand and his team are a bunch of very talented and creative photographers. They made sure to capture all the functions beautifully. We were really happy with all the images and videos that we received."],["Saaksha","5.0","The team were fabulous and lovely to work with. They integrated themselves so well that they were able to capture the magic without even being noticed! We have recommended them to all our friends and family as they were so professional, yet fun to be around. "],["kiarra11111","5.0","Photographs are something which we all cherish forever n feel nostalgic bout it. If u want the best photographs to remember on your special day then Reelsandframes are the ones for you :D . You don't just get a photographer, you get an extra person in the wedding\/bridal party planner they literally have thought of everything and has tips n advice for everything. You won't regret hiring them trust me. Theyget the most natural and beautiful pictures. I would recommend all of you Reelsandframes in an instant over anybody else :))) "],["Roshni Sahni","5.0","<p><span style=\"color:rgb(34, 34, 34); font-family:arial,sans-serif; font-size:small\">Captured some beautiful moments which will be cherished forever.<\/span><\/p>\n"]]},{"name":"Reminiscence Photography","rating":"4.7","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/vendor_cover_pic\/8473\/41b5349a-d337-4fa1-8e8b-53fa1a0180b2.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294963_DSC07400.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294986_DSC02169.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294971_DSC00129.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294995_DSC00759.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294981_DSC07219.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294987_DSC07235.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294940_DSC07520.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294904_logo_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294929_REL01394.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294977_DSC07546.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/33995\/1585294976_DSC00299.jpg"],"prices":"50,000","address":["Sasthamangalam, Trivandrum (Thiruvananthapuram)",""],"description":"Reminiscence Photography are an electric group of photographers who have one objective in mind-hand deliver you joy and eternal memories. Located in the beautiful locales of god’s own country, Kerala, Reminiscence is an ingenuity that has made strides in the field of wedding photography as well as the field of advertising. They are an inspired group of photographers who are global both in their thinking and photography. They capture your precious moments to create memories that last a life time! They are best in clicking candid shots which shows a unique chemistry and love between the family. They have been on WedMeGood since 2 years and have an enormous industry experience of around 7 years. They make you feel very comfortable while the shoot is going on and natural expressions are captured at the perfect time.Services offered:Wedding PhotographyPre-Wedding PhotographyCandid PhotographyTraditional PhotographyBridal PortraitsWedding Albums","review":[["Vani Venugopal","3.5","They offer a a good combination of traditional and candid photograghy.. I hired them especially after seeing their seeing their candid videos,they’re really good. \nThey are not very pushy but managed to get some very good shots.\nAnother good thing is that they give the raw images really quickly and they also offer customised packages according to the size of your functions and budget."],["Nitha Anilesh","5.0","The best wedding photographers.. They were very comfortable.. Weddings are captured by the best. Thankyou for making my big day much special for us."],["Anju elza","5.0","The best wedding photographers.. They were very comfortable.. Weddings are captured in  best way.   I really appreciate the effort and creativity....Thankyou for making my sis special day even more special.."],["Jerin Raj","5.0","Very much innovative works. Must for a pre wedding shoot. Great team. They make you feel so comfortable while the shoot is going on. Natural expressions captured at the perfect time. Highly recommend this Reminiscence Photography Team to capture the precious moments of your life."],["Abhijith R P","5.0","They did a fabulous work for my cousins marriage function.\n\nThe best thing we all loved about his work is they show very much dedication to their work.\n\nRelish needs no description about how things have to be done. The way he captures the moments cannot be described in words or lines.\nThank you for the awesome work!! @relishkurian"]]},{"name":"Rohan Mishra Photography","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1551078991_Acroyoga_couple_shoot.jpg?crop=97,172,1225,689","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1632397416_3.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1694752018_Z91_4442.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1607599583_Preetha___Karthigeyan_16.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1563001057_5.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1702394547_DSC_7531.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1694752269_Z81_4029.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1694752200_DSC_2649__2_.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1694752389_Z81_3586.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1632397543_Ajeethaa_Abhijit_0053.jpg?crop=49,109,1883,1253","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1632397416_11.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/8225\/1634099666_Ismath_Javith_Wedding_0713.jpg"],"prices":"65,000","address":["Thoraipakkam, Chennai",""],"description":"Rohan Mishra Photography is a wedding photography service run by the dynamic husband and wife duo, Rohan and Puja. They are truly veterans in their job, being among the first candid photographers in Chennai. With all these precious years of experience and an undying love for their craft, Rohan and Puja at Rohan Mishra Photography aim to capture every moment of your special day. Their camera reel is dedicated to snapping your joys, sorrows, anxieties and excitement, all with equal enthusiasm. Rohan's command on advanced photography techniques combined with Puja’s experience in advertising, styling and ideation leads to some amazing images that the couple will treasure for a lifetime.From The Photography Team:“Our passion for wedding photography is grounded in the pure joy of celebrating 'LOVE' which we get to see only at a wedding.We capture the beauty, the details, the emotions and most importantly \"YOUR LOVE STORY\". After the shoot, we put our creativity to shape and make beautiful Storybooks for each couple that tells their story in an absolutely exclusive manner. Our fun and relaxed approach will make your day as memorable as the images we will provide to you in a gorgeous custom made album that ensure that your memories will be cherished for generations to come. We believe, photographing weddings is more than simply documenting the events of the day. Providing truly great memories requires insight, intuition and the ability to connect with people on an emotional level and this is what makes those images stand apart.”Services Offered by Rohan Mishra PhotographyRohan and Puja at Rohan Mishra offer a host of services associated with wedding photography. These include:Candid PhotographyTraditional PhotographyPre-Wedding PhotoshootWedding Albums...and much more. Does Rohan Mishra Photography travel to outstation weddings?The team of professionals at Rohan Mishra Photography are happy to travel across the country for weddings. They are skilled at capturing destination weddings and thoroughly enjoy doing so. In such cases, the travel and accommodation charges are borne by the clients. Working StyleRohan, Puja and their team are a lot who are always excited about their job. They assure you that they can make you laugh, and feel comfortable and confident, in front of the camera. They are vibrant and happy, and bring out the same in their clients. That is what they consider the secret to gorgeous and fun photographs! You can view the portfolio of Rohan Mishra Photography on the WedMeGood portal, for your reference. After all, a picture is worth a thousand words! For more details and any other queries, you may contact the team.","review":[["Apoorv Mishra","5.0","Rohan Mishra Studio did an outstanding job capturing our wedding. The photographers were incredibly professional and had a great eye for detail. They beautifully documented both candid moments and traditional portraits, giving us a collection of photos that we will treasure forever. The team was friendly and made everyone feel comfortable, and the final images were of exceptional quality."],["Srinidhi Iyengar","5.0","Rohan, Puja and their team were wonderful to work with. Our wedding pictures were extremely dreamy and came out better than we could have ever imagined. They made us feel extremely comfortable on the event days. They were extremely professional, helped us with posing and were totally non-interfering during the ceremonies. We could not have asked for a better team to work with.Source"],["Harini ","5.0","As a US-based NRI couple, we’re extremely fortunate to have worked with Rohan, Pooja and team. They were an essential part of why our wedding was a resounding success—not only did me and my husband love working with them but so did our families, friends, and guests with whom Rohan’s team equally covered and showcased in the best possible ways.Source"],["Richa M","5.0","Amazing photographers and a great team!! We trusted Rohan's team for our maternity shoot and they were so amazing! \n\nHe came up with creative ideas and made sure we enjoyed our experience and the time we spent with him. The delivery of the photos was as promised and as we desired. :)\n\nWe highly recommend Rohan and his team! Thank you again."],["Melody Pence","5.0","I recently had the pleasure of booking a family photoshoot with Rohan in Toronto, and I can't express how delighted I am with the entire experience. From start to finish, it was an unforgettable journey. Booking the photoshoot was a breeze. Rohan was responsive and accommodating, helping us select the perfect location, and discussing our preferences for the shoot. His professionalism and prompt communication immediately put us at ease. Prior to the shoot, he provided valuable advice on clothing choices and even helped us finalize the poses we wanted. This level of preparation made the day of the shoot stress-free and enjoyable. He was not only skilled but also exceptionally patient and friendly, especially with our young children. He managed to capture genuine moments and emotions, turning ordinary poses into beautiful memories. His creativity and attention to detail were truly commendable. Rohan's editing skills brought out the best in each image while maintaining the natural essence of the moment. The final results were nothing short of stunning. We received our edited photos well within the promised timeframe, and the quality exceeded our expectations.\nOur family photoshoot was not just a session; it was an unforgettable experience filled with laughter, love, and bonding. I can't thank Rohan enough for preserving these precious moments. This family photoshoot was a heartwarming experience that I would recommend to anyone looking to create lasting memories with their loved ones. We will cherish these photos forever, and I am grateful to have found such a talented and passionate photographer to capture our family's story."],["Suresh Michaelraja","5.0","We engaged Rohan Mishra and his crew for our daughter’s Wedding in Chennai recently in May. It was a wonderful experience working with Rohan and his entire team and the delivered photos and videos were amazing. Right from the start, the engagement was very professional and the team was very Creative in telling the Story. They captured true emotions and love in all the events and built a beautiful story around it, with original ideas and well crafted storyline in each of the deliverables. They paid attention to details even before the events by visiting the venues and collaborating with other vendors like stage decorators. The team was flexible and at the same time acted in timely manner to keep the events uninterrupted. Thank you Rohan Mishra, Puja, Jagadeesh and the entire team for your creativity, professionalism and high-quality deliverables."],["Ayesha Ghyaz","5.0","Excellent team Rohan and Puja.Love the photography and videography done by them during our sons wedding.They know exactly what we want and the final outcome is v good."],["Aparna","5.0","The entire team along with Rohan Mishra and Puja is an absolute pleasure to work with. They make the entire photo\/video shoot enjoyable. The team is very well organized and efficient in completing the shoot. They have a very clear idea about the end images and work towards it, making the entire experience very smooth for us. They were very professional and polite throughout the entire time. Rohan will provide you with suggestions for decor, Venue, dresses etc.,well before the actual date, If you like, in order to get the best pictures. I highly recommend the team to everyone."],["Srinidhi","4.0","One of the best decisions I took for my wedding was choosing this husband and wife duo as our photographers. They are amazing, our photos turned out so beautiful. Everyone who’s seen our photos has complimented us on them and praised the photographer. They are extremely professional, help you with posing and are totally non-intrusive during the ceremonies. They also designed and a wonderful album in a teak box to remember our wedding by. I recommend Rohan Mishra and his team to anyone for the biggest events in their life, trust me this is the easiest and best decision you’ll make."],["Himanshu","5.0","The team is known for its quality, technique and high-quality Service. I had taken the service of ROHAN MISHRA PHOTOGRAPHY for my wedding. They are very dedicated and adapt as per the venue in quite a limited time, making you comfortable as a client. I liked their personalised way of delivering the final product - making you feel special at every stage.\n\nThank you so much to the whole team for narrating our story through your lens. You have captured our moment which will be cherished for long :)"]]},{"name":"Safarnama Film","rating":"0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1621932469_188015932_178177337545279_4967670425742129746_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450826_JD_02060a.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450872_JD_02089.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450873_JD_02103.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450874_JD_02218.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450867_JD_02246.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450865_JD_02280.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450855_JD_02303.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450865_JD_02482.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450892_JD_02508.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450881_JD_02642.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/2074179\/1655450895_JD_02677.jpg"],"prices":"25,000","address":["Vesu, Surat",""],"description":"Safarnama Film is a popular wedding photography and cinema brand operating from Surat. Services Offered:Candid PhotographyWedding FilmsTraditional PhotographyPre-Wedding ShootsAlbumsPre-Wedding Films","review":[]},{"name":"Shutterdown - Lakshya Chawla","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/vendor_cover_pic\/274\/13f57a68-51eb-4e3b-9c3c-cb70f620bdf4.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566447557_TKP_9845.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203758_PAR00709.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203864_Relaxed_Bride_1.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1530606370_with_W_M_1MB.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203578_DSC00704_Edit.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1530606213_LAK_4734.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203718_PAR09282.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203713_PAR09347.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566204030_DSC09337.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203565_PAR06286.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1211\/1566203130_31.jpg"],"prices":"230,000","address":["Gurgaon, Gurgaon",""],"description":"Shutterdown  is a wedding photography company established by Lakshya Chawla. Based out of Delhi NCR, his team leaves no stone unturned to cover weddings to the best of their ability. They are a leading choice for destination weddings all over India. Their entire team is great with the camera, capturing candid moments between the bride and groom, as well as their families. Shutterdown - Lakshya Chawla makes sure that they use only the best tools and techniques prevalent in the business. They're also fabulous with various types of videos, be it the wedding film or the teasers, they're sure to keep the entire family enagaged.Shutterdown Photography is considered among the best candid wedding photographers in the country. To add to that, they are also nicknamed as “Destination Wedding Specialist.” They have covered weddings across coveted locations in India such as Udaipur, Goa, and Jodhpur, along with international weddings in Kenya, Tanzania, Hong Kong. They have upcoming projects lined up in East Europe and Southeast Asia. Additionally, Shutterdown - Lakshya Chawla’s cinematography team has one of the best cinematographers of the country having more than 10 years of rich experience in cinematography.From Shutterdown - Lakshya Chawla:“Every Indian Wedding is a blend of multiple emotions.\" So the team at Shutter Down Photography are a team of highly experienced wedding photographers and cinematographers who aim to create a visual diary of love, laughter and emotions. We love the whole transformation of how two people transcend to become soul mates. We’ve travelled around the globe to capture wonderful weddings and on our way we have unraveled the true essence of a wedding. We aim to build client relationships, as we know that wedding is a very pivotal part of Indian tradition and thereby we ensure that we capture it beautifully and wrap it up with our magical skills of candid photography and cinematography.**Services Offered by Shutterdown - Lakshya Chawla:Shutterdown offers several services related to wedding photography and cinematography:**Still PhotographyCandid Wedding PhotographyTraditional PhotographyWedding FilmsSave the Date VideosTeasers … and a lot more.Working Style of ShutterdownShutter down pride themselves on their quirky style of photography the vivid barrage of colours used in their pictures. They take up only limited weddings every month, thus ensuring that they are able to give complete dedication to every project and please you with the final results. The wonderful reviews by previous clients are testimonial to this claim. Rest assured, you are bound to have a great experience with their team if you plan to book them for your wedding in Delhi NCR or for your destination wedding anywhere across the globe.Latest Pricing and Portfolio of ShutterdownTo know more about their services, contact them directly through the wedmegood portal. Explore Shutterdown photography prices, photos, reviews, charges and packages by scrolling through their profile and book them to get the best deals!","review":[["Sanya Choudhry","5.0","ShutterDown team was an absolute joy to work with! They were so friendly and made us feel completely at ease throughout the wedding. Every single person on the team worked tirelessly to capture every moment perfectly. They even went above and beyond to make sure every detail was covered. All our photos and videos were delivered right on time (rather before time), and they exceeded our expectations in every way. A huge shout out to Sahil and Naro! Their happy faces and positive energy made our special day even better. Thank you, ShutterDown, for everything!"],["Priya ","0.5","Before I was hitched I knew that I want shutterdown to film my wedding. I loved there work and concept . But Chosing them was a very wrong decision . They messed up all photography and videography of my wedding .\nThey did not capture the video bytes from the groom and brides parents for the video .\nNo couple photo with the hashtag .\nNo solo photo of bride or group with their parents or siblings in the entire Sangeet and wedding ceremony \nDid not make clear dance performance videos of the families and friends stating that they didn’t have the audio files .( it’s their duty to ask the event team to give it to them from the choreographer) \nThey being in the industry for long did not take care of the minute small details .they did not coordinate well with the event management team .\nWhereas I the bride ,myself had to explain them to give a person with the couple\nTo capture the photos . I had to tell them the mistakes and glitches they made during the entire wedding functions . For me my wedding was supposed to be the special day of my life , but they ruined it . I spoke to the entire shutteedown team and each one of them agreed to the mistakesqdw and just had Sorry to say .\nI told Lakshay that he needs to reimburse me the entire money I spent after giving such bad service and zero satisfaction or offer me free photoshoot .\nTo which they never replied \nI would never recommend them to anybody . "],["Revaa","5.0","They did the photography for my wedding, and they were absolutely incredible! Their attention to detail, creative shots, and ability to capture every special moment made the entire experience unforgettable.Source"],["Surbhi","5.0","Choosing ShutterDown as our wedding photographers and videographers was a decision we made with absolute confidence, thanks to the unforgettable experience they provided at my sister's wedding eight years ago. From that moment, I knew they were the perfect choice to capture the magic of Anmol and my special day. Throughout the entire process, ShutterDown made us feel incredibly comfortable and at ease, ensuring that every moment was captured authentically and beautifully. Their ability to create magic with each shot is truly unparalleled, and they effortlessly brought our vision to life. From the first consultation to the final delivery of our photographs and videos, ShutterDown executed our vision with professionalism and skill, exceeding all expectations. They truly are the best in the industry, and their passion for their craft shines through in every image they capture. What sets ShutterDown apart is not only their exceptional talent but also the way they make you feel like family throughout the entire journey. They go above and beyond to freeze your love in a photograph, creating memories that will be cherished for years to come. Without a doubt, ShutterDown is the perfect choice for anyone looking to capture the essence of their wedding day in the most beautiful and meaningful way possible.Source"],["Mannat","5.0","Lakshay and his team were not just like any photography team. They went above nd beyond to make Samrath and I including all of our family and guests feel extremely comfortable. Lakshay is a part of family.. I LOVED working with him and his team. They would do shoots in any weather condition and at all the events capture our moments seamlessly. Their entire team understands the couples vision really well and was able to coordinate large scale weddings perfectly!Source"],["krishna ","5.0","Absolutely amazing team who really went above and beyond. Lakshya and the team were so accommodating and organized. Although we are camera shy, they made us feel so comfortable and made sure we had fun the whole time! We will forever treasure the beautiful photos.\n\nSource"],["Priyamvada Tomar Ray","5.0","They are a wonderful team led by Lakshya Chawla and they covered my Roka, Mehndi, Sangeet, and Wedding. Lakshya is not only a talented photographer but has such a joyous and calming personality, qualities any bride would be grateful to have in her photographer. It is so crucial to have the right people around you at such a time and Shutter Down was absolutely brilliant. Everyone is incredibly friendly and patient. The team is very skilled at what they do. Communication with the admin team is also very efficient with prompt response.\n\nSource"],["Adya","5.0","One of my favorite vendors to work with during this process. Lakshay and his team made my entire family feel so comfortable and their sense of humor helped us have so much fun during every part of the process. His team is so professional from before the wedding even begins. We had guests fly in from around the world and they all were so impressed at Shutterdowns app and face recognition features.\n\nSource"],["Athena Sharma","5.0","The Shutterdown team has been my dream photography team since 2018. I met them at a friend’s wedding and even though I had no groom yet, I already knew Lakshya and his team would be my photographers. I’m sure I’ll include you guys in all my special moments, save a space in your diary for my baby shower booking!\n\nSource"],["AgrimaKohli","5.0","Lakshya and his team is absolutely amazing. They did an excellent job with our photos and especially the video.\n\nSource"]]},{"name":"Tanushree Bhasin Photography","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/project\/260770\/1692965915_0N1A1840.jpg?crop=13,122,2023,1138","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503951_0N1A1881.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503774_250.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503956_0N1A1379.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1692689378_20.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503845_0N1A0717.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503955_0N1A1333.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1692689927_398.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503943_727.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1617985310_215.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1708503796_40.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/7283\/1692689927_A19I2695.jpg"],"prices":"70,000","address":["Lajpat Nagar, Delhi NCR",""],"description":"Tanushree Bhasin Photography are excellent wedding photographers. They believe in making your “THE” day memorable. They want to make you feel like a celebrity for the same reason. They are a group of professional photographers who know how to capture all of the emotions expressed that day in a single frame, specializing in Photographic Cinematic Wedding Stories. Pre-Wedding Shoots & Candid Wedding Photography! We are a group of photojournalists who enjoy telling stories through our lenses! India Wedding Photographer for destination weddings. Their team of experts does arrangements for their client’s specific desires and visions, helping to ensure that their wedding is everything they hoped for. They work with various price points without compromising service quality to serve a diverse core audience. They have been doing this work for a very long time and hence have a lot of experience. Services offered by Tanushree Bhasin PhotographyClients generally look for a plethora of variety in the services offered by the makeup artist because this makes them seem diverse and an expert. Some of which are mentioned below. They are excited to travel throughout India. They are both genuine, just like the standard pro. They offer services like:Candid PhotographyWedding Films Pre Wedding Shoots Pre Wedding Films Maternity Shoots Fashion Shoots these are photographers by trade as well as by passion; they are entertainers who will bring to life events that are happening now as well as in the future. All this variety in their services is the main attraction for the clients. Absolutely everything is taken care of them. They commit to taking care of the bride and groom’s most important day.Tanushree Bhasin Photography’s working styleThey have a delivery time of about a month which is roughly some days. Also, the most booked package of their till date is a good figure. They take care of the minutest detail and have an eye for perfection. This eye for detail that they have enables them to capture the hearts of all their clients with their work.","review":[["Prerna Parashar","5.0","Tanushree and her team covered all our wedding functions. They took the most candid interviews and edited them into a beautiful movie\/ trailer. They understood who our main people were and made sure to capture them perfectly. "],["Abhirup Dam","5.0","I booked Tanushree and her team for my cousin's three-day wedding. She is not only a talented photographer but also great at bringing out the best in people. She has a dedicated and hard working team who ensure that you are treated with extra care and attention. Highly recommended"],["Arushi Singh ","5.0","Tanushree’s team was wonderful to work with! \n\nWe had a very big reception event and Tanushree’s team handled it with great efficiency. They captured so many beautiful candid moments, as well as politely corralled guests for group photos, all while keeping constant documentation of us (the bride and groom). They made sure to learn who was who in both sides of our family so that they could give enough coverage to our parents and close relatives as well. They made sure to handle all planning and info gathering well in advance of our events so that they could operate independently, allowing us to focus fully on the wedding. \n\nTheir filming of the wedding and mehendi ceremonies was beautifully cinematic, and captured not only the bride and groom, but also the guests reactions, excitement, and happiness. \n\nThe team was flexible with the unexpected but often unavoidable last minute changes that happen in weddings, and were always courteous, professional, and warm.\n\nWe and our families have framed so many photographs from the event captured by Tanushree Bhasin Photography. They really did a beautiful job! "],["Pratima Chabbi","5.0","Tanushree is an outstanding wedding photographer. Our interactions before the wedding were easy. She was attentive to our ideas and preferences and understood our style and desires. What truly sets her apart is her professionalism and ability to blend seamlessly into the event. Throughout the day, her unobtrusive presence ensured that the entire experience felt natural and relaxed for my cousin and her partner. We never felt like we were posing for the camera; we could be ourselves, and the photos reflect that authenticity.\n\nEvery photograph captured the essence and emotion of the moment, preserving memories that will last our family a lifetime. Her ability to capture candid shots was remarkable, and we hardly noticed her presence, yet she managed to encapsulate the most heartfelt and genuine moments of the day. Thanks for gifting us with photographs that we will cherish forever. "],["Aparajita Bhasin","5.0","Tanushree and her team were super fun and easy to work with, and the photographs and videos came out really beautifully. The team was very receptive and were always ahead of what needed to be done. Their personalise approach and Tanushree's involvement really made a huge difference. Thanks CWB for covering my cousin's wedding !"],["ashish","5.0","Extremely professional and cooperative.. gave us confidence at every step.. delivered everything professionally and on time and high quality work.. \nThey really understand that wedding functions can be stressful and they are super in tune with what the groom\/bride family wants.. amazing value for cost, very grateful to have had them cover our reception!"],["Rajat Narang","5.0","It's been 2 years since our wedding but it feels like yesterday only, all thanks to the memories created by Camera waale Baraati!! As soon as we saw their work we knew they were the right fit for what we wanted on our wedding. Right from the planning to execution and delivery Tanushree was personally involved with each and every aspect of the work and due this personal touch they truly understand the type of clients they are working with and their tastes and work with you accordingly. We don't like to pose much and they were made fully aware of the same and were fully sensitive towards that. We specifically wanted more of candid work and they truly delivered with 5 star quality. Also, they were very punctual, we never had to call Tanushree to be on time, in fact it was the opposite, they reached before time on every venue and called us everytime as we were running late!\n\nTheir technique is truly different from everyone else and their attention to detail is mind blowing. The cherry on top is the cinematography. Again, due the personal touch involved they know you as a client and what you want in terms of songs in the videos too and they didn't disappoint at all. The songs completely compliment the earthy wedding we had.\n\nAll in all I would say you get what you pay for. The quality is there for all to see and I would happily recommend them to anyone who wants to have a genuine work done for their wedding!\n\nKudos to the whole team..."],["Noopur Abhishek","5.0","Tanushree and team are incredibly talented. They shot three intimate events for my wedding and clicked natural and authentic photos, and recorded a fun, memorable video. Would recommend them for small or big occasions, a pleasant and competent team, who deliver high quality outputs at affordable prices! "],["VibhintaVerma","5.0","They were and are still lovely. I shortlisted CWB from the options on the WMG app and my brother coordinated booking them over the phone. Tanushree and her team were the perfect choice for us. Their team worked all day (from the haldi till the pheras) without any fuss. They were so unobtrusive and cooperative. Ours was a small wedding in the midst of the lockdown (only 50 people) and the best part was that these guys blended so seamlessly into the crowd and did their job without causing any inconvenience to anyone. The images and the videos are lovely. They are authentic moments, without excessive touch ups and editing. There are some beautiful images captured by them. Am so happy to have chosen them "],["Sahil Sambhi","5.0","CWB were such thorough professionals  with a very personalised approach. That's what you want when you hire someone to capture your best moments. Loved having them to cover us. All the best to the entire team."]]},{"name":"The Wedding Files","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1608821675_image2167.jpg?crop=0,55,1273,716","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1663242334_image907.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1652683854_image2526.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1652683857_image9839.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1619112314_image877.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1619112261_image754.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1619112383_image3001.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1606397525_TWF_1279.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1619112336_image1454.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1606397509_TWF_9494.JPG","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1606397643_056A5843.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/274268\/1642230151_image9263.jpg"],"prices":"180,000","address":["Sector 17, Chandigarh",""],"description":"The Wedding Files, a photography company based in Delhi founded by Amrit Arora, specializes in taking beautiful pictures. They collaborate closely with the family, never skipping out on crucial occasions. They are candid as well as traditional photography experts. They’re professionals who believe in putting a smile on the faces of those they capture. They specialize in candid photography, traditional photography, pre-wedding shoots, wedding movies, albums, etc. **Working Style of The Wedding FilesThey understand the importance of your special occasion and bring out the magic in your photographs in the most subtle and unique way. They strive to make your special day even more special by capturing your memorable moments with utmost precision. Understanding the emotions that go into your special day, they ensure to capture all the precious moments and become a part of your special day by adding their personalized touch. With their knowledge of the latest camera techniques, they put their heart and soul into preserving your precious memories with the utmost care that you will cherish for a lifetime, making them a great choice for your wedding. They believe that it's the tiny details that hold the best memories and they capture those details with ultimate perfection. By the The Wedding Files team\"Wedding is the purest sacrament for us then how could we miss any moment of it? We believe, that your wedding album should be a self-spoken piece of art that tells a story of love that, after 10 years from now, when you will look at it; it will still give you goosebumps, as your wedding day will give you now!\"Services Offered by The Wedding FilesThey put in a lot of effort to capture all your special moments and add life to those photographs. You should choose a photographer that is not only within your budget but also suits your style and is able to deliver services efficiently. You can book them at our site and give your wedding pictures a beautiful touch. They provide all kinds of photography and videography services. Their wide range of services includes:Candid PhotographyTraditional PhotographyPre-wedding shootsCinematographyWedding VideographyBridal PhotographyPre Wedding and Wedding filmsCouple photoshootThemed photographyPortfolio\/Fashion shootsOpen to destination weddings?The Wedding Files team travels to your destination to capture your wedding in the most beautiful and memorable way and deliver the photos within record time, providing fast and efficient services to the clients.Choose The Wedding Files to capture your precious memories and turn them into cherished keepsakes. Contact them today to discuss your photography needs and let them create a beautiful visual narrative of your special day. Make sure you go through The Wedding Files reviews. For The Wedding Files price, be sure to reach out directly to them for the best deals and packages. ","review":[["Ridhi ","5.0","As a makeup artist in the industry for years, I’ve had the opportunity to work with numerous photographers. But when it came to my own wedding, The Wedding Files was the only name on my list—and for all the right reasons! The professionalism and artistry that TWF brings to the table are unmatched. Their entire team works seamlessly, making everything feel effortless while capturing every emotion, detail, and moment with perfection.Source"],["Shivani ","5.0","Incredible, head photographer Amrit has an amazing eye and makes you feel very comfortable. Was very friendly and decisive, came prepared knowing exactly what he wanted us to do. He had our utmost trust that all the pics would come out fantastic and he delivered.Source"],["Sana Sawhney","5.0","A great team to work with! They captured all the moments beautifully and understood our style too. We’re not a couple who likes to pose, but rather a goofy couple who prefers candids & they definitely delivered on the same!Source"],["Harshit Kalra","5.0","From the moment I got engaged, I knew I wanted The Wedding Files to capture the most special days of our lives—and I’m so glad I did! Amrit, you and your team are nothing short of INCREDIBLE. Your talent is unmatched, and I honestly can't imagine anyone doing a better job than the entire team of TWF.\n\nWorking with you was such a joy, and my whole family felt completely at ease. Unlike many photographers who can create unnecessary stress for couples and guests, the TWF team exudes professionalism and grace. You captured everything so beautifully and seamlessly.\n\nI can't thank you enough for the memories you've helped preserve. Wishing you all continued success and may you continue to thrive and shine. Sending you all my love and gratitude!\n\nWith Much Love , \nRidhi and Harshit"],["Dhruv Sharma","5.0","Weddings are made in heaven, but to record the day and keep those special moments forever, you need an excellent photography team. For us, it was The Wedding Files. A good seven to eight months before the wedding, we started narrowing down our long list of potential photographers. We evaluated Instagram pages, reviews of wedding pages, prices, and other factors and concluded that The Wedding Files, without any doubt, was the best option.\n\nLet me list some things that stood out for us\n\n1. They were punctual with timings; whether it was 5 am in the morning or 2 am at night, they were there.\n\n2. They remained invisible during the functions, we had no idea where they were capturing moments from and the best part they never asked to pose or stand in a certain way for pictures. Whatever they captured was natural to its core.\n\n3. The edited images and movies were stunningly gorgeous and captivating. We were blown away by the shooting angles, background music, and overall storytelling of our marriage.\n\n4. They were quite nice in listening to us about any changes we thought were necessary. Although their creativity and ability to put things together rank among the best in the wedding industry. \n\nOur experience with them was so good that now one of my friends has also selected them for his wedding shoot in Thailand. And by the way, we got our pre-wedding done from them too and it's difficult to describe the feeling of joy which we feel every time we watch it.\n\nAll in all, we are extremely happy and satisfied with the services and they have become our friends. Special shoutout to Shivam, Jogi, Diljeet and Amrit. You guys rock and we love your work!"],["Devika","5.0","Amazing work! Amrit and his team got actual mood board shots that will someday be idealised by another bride and I hope they put their faith in TWF too cos they deliver!\nSource"],["Karishma Abichandani","5.0","They are absolute rockstars! From the jaw-dropping same-day edit that wowed us at the afterparty to the breathtaking wedding photos delivered just a month later, they blew us away. We've practically worn out the play button on our video, watching it countless times. Plus, their team was incredibly hands-on, offering fantastic ideas and staying on point throughout the entire process.Source"],["prachi goel","5.0","Amazing work, great pictures and they ensure to make everyone comfortable with the camera. Creativity is top notch. We are so happy we made the best choice with them as our wedding photographers. They made it amazing, easy and perfect. From pre-wedding to the wedding shoot all turned out a fantasy..The personal touch is just the cherry on the top."],["Shivangi ","5.0","Photographer was one of the first artists we hired. Wedding files was the first one I had gotten in touch with. They understood our requirements and gave us a lot of inputs in terms of what would work aesthetically. They personally got in touch with varun and me to understand each of us individually also did a proper research on our property which eventually came out beautifully well.Source"],["Vasudha Roy","5.0","Wedding Files were our photographers and videographers, covering everything from our pre-wedding shoot to the reception. Amrit, in particular, exuded a soft-spoken demeanor throughout. They provided us with exceptional photos and videos that now hold precious memories.\n\nSource"]]},{"name":"The Wedding Story","rating":"0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1538225310_37512048_421525041584440_6450854137708937216_o.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472928_Screenshot_from_2020_02_23_21_11_07.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472927_Screenshot_from_2020_02_23_21_11_20.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472926_Screenshot_from_2020_02_23_21_11_33.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472926_Screenshot_from_2020_02_23_21_11_49.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472925_Screenshot_from_2020_02_23_21_12_03.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472924_Screenshot_from_2020_02_23_21_12_23.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472924_Screenshot_from_2020_02_23_21_12_57.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472924_Screenshot_from_2020_02_23_21_13_09.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472923_Screenshot_from_2020_02_23_21_13_18.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472922_Screenshot_from_2020_02_23_21_13_41.png","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/443637\/1582472922_Screenshot_from_2020_02_23_21_14_09.png"],"prices":"15,000","address":["Kolkata",""],"description":"The Wedding Story has a team of wedding photographers who are skilled professionals and excel in their work. They are based out of Kolkata and are also willing to travel outstations for their services. They specialise in all kinds of photography services whether it may be candid or traditional photography. They have been shooting weddings for the past 5 years now and owing the years of experience they deliver the best of their work for their clients.Services Offered:  Candid Photoshoot  Traditional Photography  Wedding Albums  Maternity Shoots  Pre-Wedding Photoshoot  Fashion Photography","review":[]},{"name":"The White Box","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/project\/237064\/1677141895_KARAN_TAMARA_1632.jpg?crop=3,540,1276,718","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054419_154429292_273043577605569_6495625833067695038_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054419_237526083_344403543740664_5746222771144991266_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054419_243514746_391844675861919_2584662931672897716_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054418_279685745_767433501334364_6381488620874442825_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054418_279734240_556766962722979_6159571961037581059_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054418_287301774_1217205585486010_3952715863102101422_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054418_287738881_5415013741925569_1711702906803920631_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054418_288112511_539244544350073_6090618429617246400_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054418_288163116_612855730331472_2340318501701523911_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054417_288651856_5181133275309696_3006804160477925076_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/583092\/1656054417_288884800_390755382855780_3428750630048639212_n.jpg"],"prices":"On Request","address":["Vasant Vihar, Delhi NCR",""],"description":"The White Box is a popular wedding photography and cinema brand in Delhi. The shots clicked by the team of The White Box are full of emotions and display the raw beauty behind holy matrimony. Also offering videography and pre-wedding shoots, The White Box is a one-stop solution for covering your entire wedding celebrations.There are various services offered by this wedding photography service for a number of wedding festivities, such as simple home engagements before the wedding to large-scale wedding ceremonies. The services offered are: Candid PhotographyTraditional Photography Traditional Videography A Cinematic Video Pre Wedding Shoots The well-equipped photographers from The White Box would be happy to travel to your preferred wedding destination and provide their wide range of services for your wedding ceremony.","review":[["Maansi Parikh","5.0","I must have shared at least 500 references for The White Box to sift through. Before that, I spent months searching for the perfect photography team that aligned with my vision and aesthetic. I wanted simplicity paired with technical expertise, extreme candids with just the right amount of guidance for Karan and me, especially since posing doesn’t come naturally to us. My pictures had to be perfect, and I’m incredibly emotional, which they completely understood. They made us feel so at ease, capturing our moments beautifully and making the entire experience comfortable—even for the videos. Also we ensured that we spent a little time with them, hung out, took a few pre wedding pictures etc, about 2 months before the wedding functions actually started. It was super important to us that they get to know Karan and me and our story. Source"],["Shubhangi Verma","5.0","One of the best decisions of our entire wedding. The team is so warm and they do not leave any stone unturned to make you feel comfortable. They have made our looks look editorial. Absolutely loved working with them.Source"],["Mahek","5.0","They had a clear vision of how they wanted to capture our wedding and did a commendable job. All the photos looked straight out of a magazine shoot thanks to them!Source"],["Imaan ","5.0","Must say they are one of the best team of photographers who we have met till date. They are so humble and yet so professional. They captured amazing moments and created a lifetime of beautiful memories for us to share with our loved ones.Source"],["Simran","5.0","They were amazing and very professional,all the photos turned out to be really amazing I still can't decide my favourite one."],["Monika","5.0","5 stars to the team who captured our pictures in the stile we wantedSource"],["Tejal C","5.0","They were really really good. Amazing photographers."],["Arveen","5.0","Jituli, is not a photographer, she is a friend, the most calming personality and I am so glad that I met her. There are moments when you need to calm and Jituli would always be there. I would recommend White Box to everyone!Source"],["Shradha","5.0","They were the best decision I made! Sumit and jituli make you so comfortable! They way they have captured my wedding, makes me relive every moment again! I absolutely love the photos and they’ve really done an exceptional job! As for the video , it makes me cry everytime I see it! If you want real raw emotions to be captured they are the team for you! I can’t thank you guys enough! Absolutely love the entire team! ❤️"],["Shradha ","5.0","Photography for all events was done by The White Box, they were the best decision I made. No one could have captured the moments any better!\n\nSource"]]},{"name":"Unscripted Co.","rating":"4.9","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/project\/246199\/1683063100_DSCF5376.JPG?crop=3,448,1327,746","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669210250_DSCF8948.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669209405_DSCF2022.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669209574_DSCF4462.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669255746_DSCF5681.jpg?crop=17,184,1971,1108","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669210248_DSCF8969.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669208994_DCP_7142.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1670040151_DAY2_0102.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669210399_DCP_2848.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669210114_DSCF5629.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1686231721_313287744_1251408235711902_4039219634628340430_n.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/3578313\/1669209203_DSCF5133.jpg"],"prices":"60,000","address":["Mehrauli, Delhi NCR",""],"description":"Based out of New Delhi, Unscripted Co. is a wedding photography & videography company owned by renowned photographers, Jatin Chawla & Yashita Narang. With a team of experienced Wedding photographers & filmmakers who are driven by a strong desire to create stunning visuals & creative storytelling, the company stands true to it’s name & is all about people & love stories.Services offered by Unscripted Co.They are Traditional + Candid Specialist and offer a wide variety of services for your d-day that includes:Candid PhotographyTraditional PhotographyWedding FilmsPre-Wedding ShootsPre wedding FilmsAlbumsAdmired for their work by all their clients, the experts from Unscripted Co. describe their style as Fun, Cool, and Amazing. So far, they have shot weddings in cities like Delhi, Chandigarh, Mumbai, Jaipur, and Uttrakhand but they are also willing to travel to other cities to provide their services.","review":[["VrindaMatta","2.0","Highly unprofessional company.They made a mess of our wedding.Woulldnt recommend it to anyone.We hired them for our wedding in January 2023 and we have been suffering since.\n\nTo our shock , they lost our haldi program pictures with no proper excuse as to why did that happen.We had never thought that this could happen to anyone.Even after doing this to us, they did not deliver what was committed as per the contract.Wedding is once in a lifetime affair and i wouldn't recommend taking a big risk with unscripted and Co."],["Aakanksha Sardana","5.0","The team captured our wedding exactly as we wanted it! They understood that we wanted to avoid any over the top, manufactured photos and instead captured our wedding as it happened - real smiles, screams and tears! Their photos have an organic and real touch to them and they view and capture moments with such a unique perspective.Source"],["Daksh kumar","5.0","Unscripted co. is super creative and is genuinely a nice team to work with. We hired them for our engagement ceremony, what an incredible experience. We were worried about everything looking fake and forced, but they guided us through our couple session, these guys made it feel so easy. Great work, keep it up!!"],["rohit","4.5","It was the best experience with the company Unscripted co. They made sure everyone was comfortable and enjoying the little moments. We had a ball with them, everybody was so chill. Thanks for making our day more fun and memorable."],["Deepanshu Verma","5.0","Team Unscripted is a group of experts.The finest thing about their job was that they delivered on time.These guys were quite helpful for a couple like us who were far from the idea of posing and cannot fake a smile. Everyone in the family felt at ease around them, thanks for a wonderful time. We wish the team all the best for their future. It is only up from here."],["Nishant","5.0","I am so glad that I stumbled across the Unscripted. I can’t say enough about how professional they are and the quality of work that they provide is just top notch. I was so pleased with my session and final photographs, that I will continue to adore them forever."],["Aastha Yadav ","5.0","Being a shy person, it is tough to acquire excellent pictures of myself, but I believe that if it is a team like Unscripted co., then anything is possible. They made me feel comfortable and were trying to keep me calm so that i can enjoy all the little moments.When I viewed the photographs, it felt like it was a dream,the photos were very beautiful, happy with their work."],["saraswati ","5.0","The team was competent and accommodating right from the first meeting, to the ideation, to production.The visual quality and overall experience for us was outstanding. We are appreciative for the lovely memories Unscripted Co. has made for us. Our families are surely going to recommend them ahead. Cheers!🥂"],["Komal Rajoriya","5.0","There just aren’t enough words to possibly describe how amazing each and every photographs are.Jatin has a magical way of finding the perfect angle, lighting and capture the right expressions. Huge thanks to Jatin, Yashita and their team."],["Somil ","5.0","Thank you so much to this great team! Jatin's ability to capture our wedding day's genuine feelings was simply remarkable. I would strongly suggest them to anyone seeking for wedding photographers. Yashita did an amazing job keeping everything in check for us and even other team members were a delight to work with."]]},{"name":"WeddingNama","rating":"5.0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/project\/291238\/1717158901_WN_photography_03.jpg?crop=11,10,2026,1140","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969949_WN_Portfolio_2019_205.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969069_8_Wedding_309_LR.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969928_WN_Portfolio_2019_213.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969906_WN_Portfolio_2019_214.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969886_WN_Portfolio_2019_219.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969966_WN_Portfolio_2019_201.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969016_9WN_6368_LR.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969085_3_Mehendi_92.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969063_WN_Prachi_Dev_393.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969844_WN_Portfolio_2019_425.jpg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/5750\/1565969902_WN_Portfolio_2019_347.jpg"],"prices":"On Request","address":["Andheri West, Mumbai",""],"description":"WeddingNama based in Mumbai specializes in luxurious wedding photography, destination weddings as well as cinematography. It was found by husband-wife duo, Ankita and Akash whose passion is to capture one of the most beautiful events in your life and help you treasure it till eternity. They have a wide experience in the field with more than 5 years in the industry and their results are most likely to surpass your expectations. With their enthusiasm and imagination, they try to capture the most joyful days of your life. They specialize in candid photography, traditional photography and pre-wedding shoots. They also travel outstation to cover destination weddings. Understanding the importance of your special occasion and bringing the magic out in your photographs is what they aim for. They strive to make your special day all the more special by capturing your memorable moments with utmost precision. Understanding the emotions that go into your wedding day, they ensure to capture all the precious moments, and become a part of your special day by adding their personalised touch. With the knowledge of latest camera techniques, they put their heart and soul in preserving your precious memories that you will cherish for a lifetime, making them a great choice for your wedding. They believe that its the details that hold the best of the memories and they capture those details with ultimate perfection. From the team of WeddingNama\"People make memories...We capture them...!\" Service Offered by WeddingNamaA professional photographer like WeddingNama leaves no stone unturned to capture all your special moments and add life to those photographs. They provide all kinds of photography services. They travel to your destination also to capture your wedding in the most beautiful way and deliver the photos within record time, providing fast and efficient services to the clients. They provide about 700 edited pictures to their clients.  Their wide range of services include:Candid PhotographyTraditional PhotographyPre-wedding shootsCinematographyWedding VideographyBridal photographyPre Wedding and Wedding filmsCouple photoshootThey are the best photographers to hire for your pre-wedding and wedding functions. Book them now through WedMeGood.","review":[["Pamidi Bala Sumanth","5.0","We are so glad that we stumbled across them. We can’t say enough about how professional Wedding Nama is and the quality of work that they provided. We were so pleased with the final photographs and videos. Loved their work!"],["Mehak","5.0","We are so glad that we stumbled across them. We can’t say enough about how professional Wedding Nama is and the quality of work that they provided. We were so pleased with the final photographs and videos. Loved their work!\n\nSource"],["Krishma","5.0","These guys have been booked with us since 2019, when our wedding was going to be in Vietnam. They stood by us and made sure their entire team could attend our wedding. They felt the emotion of every postponement with us. Their photos are incredible. They know how to capture the moment. Truly we didn’t want to get married without them and it was the best decision. Their work is outstanding. Their professionalism is unparalleled.Source"],["Anonymous","5.0","Even after COVID being there, our wedding happened in the most magical way and it was captured even more beautifully by Wedding Nama. They beautifully and minutely captured all the moments. The entire team is super understanding and makes you feel at ease in middle of all the hustle. We only recommend Wedding Nama. They are the best.Source"],["Hetal ganwani","5.0","We purchased a few of my sister in law's jewellery from here. The workmanship is exquisite and designs are really unique. I am extremely happy with every purchase I have made so far. The staff are also polite and attentive to customers' details. I would recommend it to anyone looking for great designs and prices under budget as they have collections in all price ranges"],["Priyanka","5.0","They were an absolutely amazing team to work with and we cannot be happier with how my wedding photos and footage have turned out. We  received so many compliments from family and friends who were also in absolute awe of their work. The video looks amazing and each photograph is frame worthy.  The team had the difficult task of editing our photos and videos whilst in lockdown at home due to COVID-19. Nonetheless, they did not let this impact their quality of work! Throughout the wedding itself  the whole team was lovely to work with and we really appreciated their easy going nature. It was evident that they really put in a lot of effort to get to know us and ensured we were always as relaxed which really helped to bring out the best footage. Booking them to capture our wedding events was one of the best decisions we made. Source"],["Ayush Srivastava","5.0","I am extremely happy with my photographer. He beautifully covered my entire wedding and I loved the results. He was just amazing and did a brilliant job. Highly recommended!"],["Aakanksha","5.0","I am not one to brag but I think we all know that I made the perfect choice when I saw their page for the first time during my brother’s wedding & decided that we are gonna get them to capture all our milestone memories. The only thing I was sure about when my wedding discussions were in the pipeline that it HAS to be WeddingNama come what may. We did not even look at anyone else.\nThey are always at the right place at the right time may it be capturing the tears or the laughter or just the family fun!! Source"],["Prachi","5.0","An AMAZING team to work with, they focus on the smallest of details when it comes to the couple. They make sure to spend quality time with you to get the best shots. The team worked day & night to give us the BEST Same-Day Edit. We have watched it a thousand & one times and still can't get enough of it. Akash, Ankita and the entire team are SO fun to work with, love you guys!! Future brideys, pls note: PLS designate 1 person from both families to make SURE that all family videos\/interviews are done. My family didn't get around to doing it, that is one of my biggest regrets :( I wish I had a video montage of my parents and siblings' interviews.Source"],["Sanaa","5.0","They were an absolute dream to work with. They took the time to get to know us on a personal level, to allow us to warm up to them and to ensure that they photographed every single element we would want to cherish for decades to come. There were so many moments we would have missed if it wasn't for their sheer magic! For instance, I would have never known that Sidhanth teared up when he saw me walking down the aisle for the first time! From the very beginning, just by talking to Ankita and Akash and seeing their work, we knew that we couldn't have picked a better team to capture these moments of pure, unrehearsed emotion.Source"]]},{"name":"WhatKnot Photography","rating":"5.0","images":[],"prices":"85,000","address":["Mumbai",""],"description":"Whatknot Photography is a Mumbai based team of cinematographers. They are passionate about photography and capturing your emotions and memories in the most perfect way. They have an experience of shooting a number of weddings and are a complete package. Being the perfect choice for your wedding, they offer many services like save the date videos, wedding cinematography and even still photography.Services offered:Save the date videosWedding filmsTeaser videosLip Dub VideosStill photography","review":[["Charvi Kain","5.0","I got photography done for my marriage from whatknot. I am very happy with the services i got from them. They have captured every aspect of my wedding very beautifully.  I would like to thank the whole team for capturing  our memories for us. They were professional, friendly and easy going."],["SaloniShah","5.0","I cannot say enough good things about Aditya and the boys. From being totally non \"photographer in your face\" kinds, to making sure we don't have cheesy posed pictures or folks with food in their mouths. Very flexible and easy to work with. My favorite keepsake from the wedding remains our stunning pre-wedding photos taken at stepwells in Gujarat along with a highlight video wedding reel. They sat down with us before the wedding to understand who the key family and friends were and every frame was captured beautifully. Highly recommend Whatknot for both photography and videography."],["Anisha jain","5.0","WhatKnot and their group are excessively acceptable in thier work. Their entire group is extremely proficient and devoted towards their work.They made us astonish pictures and recordings of the entire occasion."]]},{"name":"Wow Events","rating":"0","images":["https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398917_WhatsApp_Image_2021_04_14_at_4.44.01_PM.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398917_WhatsApp_Image_2021_04_14_at_4.44.01_PM.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398585_WhatsApp_Image_2021_04_14_at_4.33.34_PM__2_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398549_WhatsApp_Image_2021_04_14_at_4.33.34_PM.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398521_WhatsApp_Image_2021_04_14_at_4.33.34_PM__1_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398482_WhatsApp_Image_2021_04_14_at_4.33.34_PM__3_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398455_WhatsApp_Image_2021_04_14_at_4.33.34_PM__4_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398412_WhatsApp_Image_2021_04_14_at_4.33.34_PM.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398385_WhatsApp_Image_2021_04_14_at_4.33.34_PM__1_.jpeg","https:\/\/image.wedmegood.com\/resized\/450X\/uploads\/member\/1559074\/1618398343_WhatsApp_Image_2021_04_14_at_4.33.34_PM__2_.jpeg"],"prices":"40,000-400,000","address":["Danapur, Danapur",""],"description":"Wow Events is a wedding design and decoration company based in Patna offering their services since 2015. Services Offered:Wedding Decorations","review":[]}]